espressif/esp-idf/components/soc/esp32s31/register/soc/efuse_reg.h
/**
 * SPDX-FileCopyrightText: 2026 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */

#pragma once

#include "soc/reg_base.h"
#include "soc/soc.h"

#ifdef __cplusplus
extern "C" {
#endif

/** EFUSE_PGM_DATA0_REG register
 *  Represents pgm_data0
 */
#define EFUSE_PGM_DATA0_REG (DR_REG_EFUSE_BASE + 0x0)
/** EFUSE_PGM_DATA_0 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 0th 32-bit data to be programmed.
 */
#define EFUSE_PGM_DATA_0    0xFFFFFFFFU
#define EFUSE_PGM_DATA_0_M  (EFUSE_PGM_DATA_0_V << EFUSE_PGM_DATA_0_S)
#define EFUSE_PGM_DATA_0_V  0xFFFFFFFFU
#define EFUSE_PGM_DATA_0_S  0

/** EFUSE_PGM_DATA1_REG register
 *  Represents pgm_data1
 */
#define EFUSE_PGM_DATA1_REG (DR_REG_EFUSE_BASE + 0x4)
/** EFUSE_PGM_DATA_1 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 1th 32-bit data to be programmed.
 */
#define EFUSE_PGM_DATA_1    0xFFFFFFFFU
#define EFUSE_PGM_DATA_1_M  (EFUSE_PGM_DATA_1_V << EFUSE_PGM_DATA_1_S)
#define EFUSE_PGM_DATA_1_V  0xFFFFFFFFU
#define EFUSE_PGM_DATA_1_S  0

/** EFUSE_PGM_DATA2_REG register
 *  Represents pgm_data2
 */
#define EFUSE_PGM_DATA2_REG (DR_REG_EFUSE_BASE + 0x8)
/** EFUSE_PGM_DATA_2 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 2th 32-bit data to be programmed.
 */
#define EFUSE_PGM_DATA_2    0xFFFFFFFFU
#define EFUSE_PGM_DATA_2_M  (EFUSE_PGM_DATA_2_V << EFUSE_PGM_DATA_2_S)
#define EFUSE_PGM_DATA_2_V  0xFFFFFFFFU
#define EFUSE_PGM_DATA_2_S  0

/** EFUSE_PGM_DATA3_REG register
 *  Represents pgm_data3
 */
#define EFUSE_PGM_DATA3_REG (DR_REG_EFUSE_BASE + 0xc)
/** EFUSE_PGM_DATA_3 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 3th 32-bit data to be programmed.
 */
#define EFUSE_PGM_DATA_3    0xFFFFFFFFU
#define EFUSE_PGM_DATA_3_M  (EFUSE_PGM_DATA_3_V << EFUSE_PGM_DATA_3_S)
#define EFUSE_PGM_DATA_3_V  0xFFFFFFFFU
#define EFUSE_PGM_DATA_3_S  0

/** EFUSE_PGM_DATA4_REG register
 *  Represents pgm_data4
 */
#define EFUSE_PGM_DATA4_REG (DR_REG_EFUSE_BASE + 0x10)
/** EFUSE_PGM_DATA_4 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 4th 32-bit data to be programmed.
 */
#define EFUSE_PGM_DATA_4    0xFFFFFFFFU
#define EFUSE_PGM_DATA_4_M  (EFUSE_PGM_DATA_4_V << EFUSE_PGM_DATA_4_S)
#define EFUSE_PGM_DATA_4_V  0xFFFFFFFFU
#define EFUSE_PGM_DATA_4_S  0

/** EFUSE_PGM_DATA5_REG register
 *  Represents pgm_data5
 */
#define EFUSE_PGM_DATA5_REG (DR_REG_EFUSE_BASE + 0x14)
/** EFUSE_PGM_DATA_5 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 5th 32-bit data to be programmed.
 */
#define EFUSE_PGM_DATA_5    0xFFFFFFFFU
#define EFUSE_PGM_DATA_5_M  (EFUSE_PGM_DATA_5_V << EFUSE_PGM_DATA_5_S)
#define EFUSE_PGM_DATA_5_V  0xFFFFFFFFU
#define EFUSE_PGM_DATA_5_S  0

/** EFUSE_PGM_DATA6_REG register
 *  Represents pgm_data6
 */
#define EFUSE_PGM_DATA6_REG (DR_REG_EFUSE_BASE + 0x18)
/** EFUSE_PGM_DATA_6 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 6th 32-bit data to be programmed.
 */
#define EFUSE_PGM_DATA_6    0xFFFFFFFFU
#define EFUSE_PGM_DATA_6_M  (EFUSE_PGM_DATA_6_V << EFUSE_PGM_DATA_6_S)
#define EFUSE_PGM_DATA_6_V  0xFFFFFFFFU
#define EFUSE_PGM_DATA_6_S  0

/** EFUSE_PGM_DATA7_REG register
 *  Represents pgm_data7
 */
#define EFUSE_PGM_DATA7_REG (DR_REG_EFUSE_BASE + 0x1c)
/** EFUSE_PGM_DATA_7 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 7th 32-bit data to be programmed.
 */
#define EFUSE_PGM_DATA_7    0xFFFFFFFFU
#define EFUSE_PGM_DATA_7_M  (EFUSE_PGM_DATA_7_V << EFUSE_PGM_DATA_7_S)
#define EFUSE_PGM_DATA_7_V  0xFFFFFFFFU
#define EFUSE_PGM_DATA_7_S  0

/** EFUSE_PGM_CHECK_VALUE0_REG register
 *  Represents pgm_check_value0
 */
#define EFUSE_PGM_CHECK_VALUE0_REG (DR_REG_EFUSE_BASE + 0x20)
/** EFUSE_PGM_RS_DATA_0 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 0th RS code to be programmed.
 */
#define EFUSE_PGM_RS_DATA_0    0xFFFFFFFFU
#define EFUSE_PGM_RS_DATA_0_M  (EFUSE_PGM_RS_DATA_0_V << EFUSE_PGM_RS_DATA_0_S)
#define EFUSE_PGM_RS_DATA_0_V  0xFFFFFFFFU
#define EFUSE_PGM_RS_DATA_0_S  0

/** EFUSE_PGM_CHECK_VALUE1_REG register
 *  Represents pgm_check_value1
 */
#define EFUSE_PGM_CHECK_VALUE1_REG (DR_REG_EFUSE_BASE + 0x24)
/** EFUSE_PGM_RS_DATA_1 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 1th RS code to be programmed.
 */
#define EFUSE_PGM_RS_DATA_1    0xFFFFFFFFU
#define EFUSE_PGM_RS_DATA_1_M  (EFUSE_PGM_RS_DATA_1_V << EFUSE_PGM_RS_DATA_1_S)
#define EFUSE_PGM_RS_DATA_1_V  0xFFFFFFFFU
#define EFUSE_PGM_RS_DATA_1_S  0

/** EFUSE_PGM_CHECK_VALUE2_REG register
 *  Represents pgm_check_value2
 */
#define EFUSE_PGM_CHECK_VALUE2_REG (DR_REG_EFUSE_BASE + 0x28)
/** EFUSE_PGM_RS_DATA_2 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 2th RS code to be programmed.
 */
#define EFUSE_PGM_RS_DATA_2    0xFFFFFFFFU
#define EFUSE_PGM_RS_DATA_2_M  (EFUSE_PGM_RS_DATA_2_V << EFUSE_PGM_RS_DATA_2_S)
#define EFUSE_PGM_RS_DATA_2_V  0xFFFFFFFFU
#define EFUSE_PGM_RS_DATA_2_S  0

/** EFUSE_RD_WR_DIS_REG register
 *  Represents rd_wr_dis
 */
#define EFUSE_RD_WR_DIS_REG (DR_REG_EFUSE_BASE + 0x2c)
/** EFUSE_WR_DIS_RD_DIS : RO; bitpos: [0]; default: 0;
 *  Write disable bit 0 for EFUSE_RD_DIS
 */
#define EFUSE_WR_DIS_RD_DIS    (BIT(0))
#define EFUSE_WR_DIS_RD_DIS_M  (EFUSE_WR_DIS_RD_DIS_V << EFUSE_WR_DIS_RD_DIS_S)
#define EFUSE_WR_DIS_RD_DIS_V  0x00000001U
#define EFUSE_WR_DIS_RD_DIS_S  0
/** EFUSE_WR_DIS_1 : RO; bitpos: [1]; default: 0;
 *  Write disable bit 1 for EFUSE_KM_RND_SWITCH_CYCLE, EFUSE_KM_DISABLE_DEPLOY_MODE,
 *  EFUSE_KM_DEPLOY_ONLY_ONCE, EFUSE_FORCE_USE_KEY_MANAGER_KEY,
 *  EFUSE_FORCE_DISABLE_SW_INIT_KEY, EFUSE_KM_XTS_KEY_LENGTH_256, EFUSE_LOCK_KM_KEY
 */
#define EFUSE_WR_DIS_1    (BIT(1))
#define EFUSE_WR_DIS_1_M  (EFUSE_WR_DIS_1_V << EFUSE_WR_DIS_1_S)
#define EFUSE_WR_DIS_1_V  0x00000001U
#define EFUSE_WR_DIS_1_S  1
/** EFUSE_WR_DIS_2 : RO; bitpos: [2]; default: 0;
 *  Write disable bit 2 for EFUSE_DIS_USB_JTAG, EFUSE_DIS_USB_SERIAL_JTAG,
 *  EFUSE_DIS_FORCE_DOWNLOAD, EFUSE_SPI_DOWNLOAD_MSPI_DIS, EFUSE_DIS_TWAI,
 *  EFUSE_JTAG_SEL_ENABLE, EFUSE_DIS_PAD_JTAG, EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT,
 *  EFUSE_DIS_WIFI6, EFUSE_WDT_DELAY_SEL, EFUSE_SECURE_BOOT_DISABLE_FAST_WAKE,
 *  EFUSE_DIS_WDT, EFUSE_DIS_SWD, EFUSE_PMU_FLASH_POWER_SEL,
 *  EFUSE_PMU_FLASH_POWER_SEL_EN, EFUSE_POWER_GLITCH_EN
 */
#define EFUSE_WR_DIS_2    (BIT(2))
#define EFUSE_WR_DIS_2_M  (EFUSE_WR_DIS_2_V << EFUSE_WR_DIS_2_S)
#define EFUSE_WR_DIS_2_V  0x00000001U
#define EFUSE_WR_DIS_2_S  2
/** EFUSE_WR_DIS_3 : RO; bitpos: [3]; default: 0;
 *  Write disable bit 3 for EFUSE_PVT_0_GLITCH_EN, EFUSE_PVT_0_GLITCH_MODE,
 *  EFUSE_PVT_1_GLITCH_EN, EFUSE_PVT_1_GLITCH_MODE
 */
#define EFUSE_WR_DIS_3    (BIT(3))
#define EFUSE_WR_DIS_3_M  (EFUSE_WR_DIS_3_V << EFUSE_WR_DIS_3_S)
#define EFUSE_WR_DIS_3_V  0x00000001U
#define EFUSE_WR_DIS_3_S  3
/** EFUSE_WR_DIS_SPI_BOOT_CRYPT_CNT : RO; bitpos: [4]; default: 0;
 *  Write disable bit 4 for EFUSE_SPI_BOOT_CRYPT_CNT
 */
#define EFUSE_WR_DIS_SPI_BOOT_CRYPT_CNT    (BIT(4))
#define EFUSE_WR_DIS_SPI_BOOT_CRYPT_CNT_M  (EFUSE_WR_DIS_SPI_BOOT_CRYPT_CNT_V << EFUSE_WR_DIS_SPI_BOOT_CRYPT_CNT_S)
#define EFUSE_WR_DIS_SPI_BOOT_CRYPT_CNT_V  0x00000001U
#define EFUSE_WR_DIS_SPI_BOOT_CRYPT_CNT_S  4
/** EFUSE_WR_DIS_SECURE_BOOT_KEY_REVOKE0 : RO; bitpos: [5]; default: 0;
 *  Write disable bit 5 for EFUSE_SECURE_BOOT_KEY_REVOKE0
 */
#define EFUSE_WR_DIS_SECURE_BOOT_KEY_REVOKE0    (BIT(5))
#define EFUSE_WR_DIS_SECURE_BOOT_KEY_REVOKE0_M  (EFUSE_WR_DIS_SECURE_BOOT_KEY_REVOKE0_V << EFUSE_WR_DIS_SECURE_BOOT_KEY_REVOKE0_S)
#define EFUSE_WR_DIS_SECURE_BOOT_KEY_REVOKE0_V  0x00000001U
#define EFUSE_WR_DIS_SECURE_BOOT_KEY_REVOKE0_S  5
/** EFUSE_WR_DIS_SECURE_BOOT_KEY_REVOKE1 : RO; bitpos: [6]; default: 0;
 *  Write disable bit 6 for EFUSE_SECURE_BOOT_KEY_REVOKE1
 */
#define EFUSE_WR_DIS_SECURE_BOOT_KEY_REVOKE1    (BIT(6))
#define EFUSE_WR_DIS_SECURE_BOOT_KEY_REVOKE1_M  (EFUSE_WR_DIS_SECURE_BOOT_KEY_REVOKE1_V << EFUSE_WR_DIS_SECURE_BOOT_KEY_REVOKE1_S)
#define EFUSE_WR_DIS_SECURE_BOOT_KEY_REVOKE1_V  0x00000001U
#define EFUSE_WR_DIS_SECURE_BOOT_KEY_REVOKE1_S  6
/** EFUSE_WR_DIS_SECURE_BOOT_KEY_REVOKE2 : RO; bitpos: [7]; default: 0;
 *  Write disable bit 7 for EFUSE_SECURE_BOOT_KEY_REVOKE2
 */
#define EFUSE_WR_DIS_SECURE_BOOT_KEY_REVOKE2    (BIT(7))
#define EFUSE_WR_DIS_SECURE_BOOT_KEY_REVOKE2_M  (EFUSE_WR_DIS_SECURE_BOOT_KEY_REVOKE2_V << EFUSE_WR_DIS_SECURE_BOOT_KEY_REVOKE2_S)
#define EFUSE_WR_DIS_SECURE_BOOT_KEY_REVOKE2_V  0x00000001U
#define EFUSE_WR_DIS_SECURE_BOOT_KEY_REVOKE2_S  7
/** EFUSE_WR_DIS_KEY_PURPOSE_0 : RO; bitpos: [8]; default: 0;
 *  Write disable bit 8 for EFUSE_KEY_PURPOSE_0
 */
#define EFUSE_WR_DIS_KEY_PURPOSE_0    (BIT(8))
#define EFUSE_WR_DIS_KEY_PURPOSE_0_M  (EFUSE_WR_DIS_KEY_PURPOSE_0_V << EFUSE_WR_DIS_KEY_PURPOSE_0_S)
#define EFUSE_WR_DIS_KEY_PURPOSE_0_V  0x00000001U
#define EFUSE_WR_DIS_KEY_PURPOSE_0_S  8
/** EFUSE_WR_DIS_KEY_PURPOSE_1 : RO; bitpos: [9]; default: 0;
 *  Write disable bit 9 for EFUSE_KEY_PURPOSE_1
 */
#define EFUSE_WR_DIS_KEY_PURPOSE_1    (BIT(9))
#define EFUSE_WR_DIS_KEY_PURPOSE_1_M  (EFUSE_WR_DIS_KEY_PURPOSE_1_V << EFUSE_WR_DIS_KEY_PURPOSE_1_S)
#define EFUSE_WR_DIS_KEY_PURPOSE_1_V  0x00000001U
#define EFUSE_WR_DIS_KEY_PURPOSE_1_S  9
/** EFUSE_WR_DIS_KEY_PURPOSE_2 : RO; bitpos: [10]; default: 0;
 *  Write disable bit 10 for EFUSE_KEY_PURPOSE_2
 */
#define EFUSE_WR_DIS_KEY_PURPOSE_2    (BIT(10))
#define EFUSE_WR_DIS_KEY_PURPOSE_2_M  (EFUSE_WR_DIS_KEY_PURPOSE_2_V << EFUSE_WR_DIS_KEY_PURPOSE_2_S)
#define EFUSE_WR_DIS_KEY_PURPOSE_2_V  0x00000001U
#define EFUSE_WR_DIS_KEY_PURPOSE_2_S  10
/** EFUSE_WR_DIS_KEY_PURPOSE_3 : RO; bitpos: [11]; default: 0;
 *  Write disable bit 11 for EFUSE_KEY_PURPOSE_3
 */
#define EFUSE_WR_DIS_KEY_PURPOSE_3    (BIT(11))
#define EFUSE_WR_DIS_KEY_PURPOSE_3_M  (EFUSE_WR_DIS_KEY_PURPOSE_3_V << EFUSE_WR_DIS_KEY_PURPOSE_3_S)
#define EFUSE_WR_DIS_KEY_PURPOSE_3_V  0x00000001U
#define EFUSE_WR_DIS_KEY_PURPOSE_3_S  11
/** EFUSE_WR_DIS_KEY_PURPOSE_4 : RO; bitpos: [12]; default: 0;
 *  Write disable bit 12 for EFUSE_KEY_PURPOSE_4
 */
#define EFUSE_WR_DIS_KEY_PURPOSE_4    (BIT(12))
#define EFUSE_WR_DIS_KEY_PURPOSE_4_M  (EFUSE_WR_DIS_KEY_PURPOSE_4_V << EFUSE_WR_DIS_KEY_PURPOSE_4_S)
#define EFUSE_WR_DIS_KEY_PURPOSE_4_V  0x00000001U
#define EFUSE_WR_DIS_KEY_PURPOSE_4_S  12
/** EFUSE_WR_DIS_13 : RO; bitpos: [13]; default: 0;
 *  reserved
 */
#define EFUSE_WR_DIS_13    (BIT(13))
#define EFUSE_WR_DIS_13_M  (EFUSE_WR_DIS_13_V << EFUSE_WR_DIS_13_S)
#define EFUSE_WR_DIS_13_V  0x00000001U
#define EFUSE_WR_DIS_13_S  13
/** EFUSE_WR_DIS_14 : RO; bitpos: [14]; default: 0;
 *  Write disable bit 14 for EFUSE_DIS_SM_CRYPT, EFUSE_ECC_FORCE_CONST_TIME,
 *  EFUSE_ECDSA_DISABLE_SOFT_K, EFUSE_SEC_DPA_LEVEL, EFUSE_XTS_DPA_CLK_ENABLE,
 *  EFUSE_XTS_DPA_PSEUDO_LEVEL, EFUSE_SDC_NONCE_ENA, EFUSE_SDC_CHIP_INFO_SOURCE,
 *  EFUSE_SDC_DISABLE_FAST_VEF, EFUSE_ENA_XTS_SHADOW,
 *  EFUSE_ENA_SPI_BOOT_CRYPT_SCRAMBLER, EFUSE_RE_ENABLE_JTAG_SOURCE
 */
#define EFUSE_WR_DIS_14    (BIT(14))
#define EFUSE_WR_DIS_14_M  (EFUSE_WR_DIS_14_V << EFUSE_WR_DIS_14_S)
#define EFUSE_WR_DIS_14_V  0x00000001U
#define EFUSE_WR_DIS_14_S  14
/** EFUSE_WR_DIS_SECURE_BOOT_EN : RO; bitpos: [15]; default: 0;
 *  Write disable bit 15 for EFUSE_SECURE_BOOT_EN
 */
#define EFUSE_WR_DIS_SECURE_BOOT_EN    (BIT(15))
#define EFUSE_WR_DIS_SECURE_BOOT_EN_M  (EFUSE_WR_DIS_SECURE_BOOT_EN_V << EFUSE_WR_DIS_SECURE_BOOT_EN_S)
#define EFUSE_WR_DIS_SECURE_BOOT_EN_V  0x00000001U
#define EFUSE_WR_DIS_SECURE_BOOT_EN_S  15
/** EFUSE_WR_DIS_SECURE_BOOT_AGGRESSIVE_REVOKE : RO; bitpos: [16]; default: 0;
 *  Write disable bit 16 for EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE
 */
#define EFUSE_WR_DIS_SECURE_BOOT_AGGRESSIVE_REVOKE    (BIT(16))
#define EFUSE_WR_DIS_SECURE_BOOT_AGGRESSIVE_REVOKE_M  (EFUSE_WR_DIS_SECURE_BOOT_AGGRESSIVE_REVOKE_V << EFUSE_WR_DIS_SECURE_BOOT_AGGRESSIVE_REVOKE_S)
#define EFUSE_WR_DIS_SECURE_BOOT_AGGRESSIVE_REVOKE_V  0x00000001U
#define EFUSE_WR_DIS_SECURE_BOOT_AGGRESSIVE_REVOKE_S  16
/** EFUSE_WR_DIS_17 : RO; bitpos: [17]; default: 0;
 *  reserved
 */
#define EFUSE_WR_DIS_17    (BIT(17))
#define EFUSE_WR_DIS_17_M  (EFUSE_WR_DIS_17_V << EFUSE_WR_DIS_17_S)
#define EFUSE_WR_DIS_17_V  0x00000001U
#define EFUSE_WR_DIS_17_S  17
/** EFUSE_WR_DIS_18 : RO; bitpos: [18]; default: 0;
 *  Write disable bit 18 for EFUSE_FLASH_TYPE, EFUSE_DIS_USB_OTG_DOWNLOAD_MODE,
 *  EFUSE_FLASH_TPUW, EFUSE_DIS_DOWNLOAD_MODE, EFUSE_DIS_DIRECT_BOOT,
 *  EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT, EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE,
 *  EFUSE_ENABLE_SECURITY_DOWNLOAD, EFUSE_UART_PRINT_CONTROL, EFUSE_FORCE_SEND_RESUME,
 *  EFUSE_SECURE_VERSION
 */
#define EFUSE_WR_DIS_18    (BIT(18))
#define EFUSE_WR_DIS_18_M  (EFUSE_WR_DIS_18_V << EFUSE_WR_DIS_18_S)
#define EFUSE_WR_DIS_18_V  0x00000001U
#define EFUSE_WR_DIS_18_S  18
/** EFUSE_WR_DIS_HUK_GEN_STATE : RO; bitpos: [19]; default: 0;
 *  Write disable bit 19 for EFUSE_HUK_GEN_STATE
 */
#define EFUSE_WR_DIS_HUK_GEN_STATE    (BIT(19))
#define EFUSE_WR_DIS_HUK_GEN_STATE_M  (EFUSE_WR_DIS_HUK_GEN_STATE_V << EFUSE_WR_DIS_HUK_GEN_STATE_S)
#define EFUSE_WR_DIS_HUK_GEN_STATE_V  0x00000001U
#define EFUSE_WR_DIS_HUK_GEN_STATE_S  19
/** EFUSE_WR_DIS_BLOCK1 : RO; bitpos: [20]; default: 0;
 *  Write disable bit 20 for BLOCK1
 */
#define EFUSE_WR_DIS_BLOCK1    (BIT(20))
#define EFUSE_WR_DIS_BLOCK1_M  (EFUSE_WR_DIS_BLOCK1_V << EFUSE_WR_DIS_BLOCK1_S)
#define EFUSE_WR_DIS_BLOCK1_V  0x00000001U
#define EFUSE_WR_DIS_BLOCK1_S  20
/** EFUSE_WR_DIS_BLOCK2 : RO; bitpos: [21]; default: 0;
 *  Write disable bit 21 for BLOCK2
 */
#define EFUSE_WR_DIS_BLOCK2    (BIT(21))
#define EFUSE_WR_DIS_BLOCK2_M  (EFUSE_WR_DIS_BLOCK2_V << EFUSE_WR_DIS_BLOCK2_S)
#define EFUSE_WR_DIS_BLOCK2_V  0x00000001U
#define EFUSE_WR_DIS_BLOCK2_S  21
/** EFUSE_WR_DIS_BLOCK3 : RO; bitpos: [22]; default: 0;
 *  Write disable bit 22 for BLOCK3
 */
#define EFUSE_WR_DIS_BLOCK3    (BIT(22))
#define EFUSE_WR_DIS_BLOCK3_M  (EFUSE_WR_DIS_BLOCK3_V << EFUSE_WR_DIS_BLOCK3_S)
#define EFUSE_WR_DIS_BLOCK3_V  0x00000001U
#define EFUSE_WR_DIS_BLOCK3_S  22
/** EFUSE_WR_DIS_BLOCK4 : RO; bitpos: [23]; default: 0;
 *  Write disable bit 23 for BLOCK4
 */
#define EFUSE_WR_DIS_BLOCK4    (BIT(23))
#define EFUSE_WR_DIS_BLOCK4_M  (EFUSE_WR_DIS_BLOCK4_V << EFUSE_WR_DIS_BLOCK4_S)
#define EFUSE_WR_DIS_BLOCK4_V  0x00000001U
#define EFUSE_WR_DIS_BLOCK4_S  23
/** EFUSE_WR_DIS_BLOCK5 : RO; bitpos: [24]; default: 0;
 *  Write disable bit 24 for BLOCK5
 */
#define EFUSE_WR_DIS_BLOCK5    (BIT(24))
#define EFUSE_WR_DIS_BLOCK5_M  (EFUSE_WR_DIS_BLOCK5_V << EFUSE_WR_DIS_BLOCK5_S)
#define EFUSE_WR_DIS_BLOCK5_V  0x00000001U
#define EFUSE_WR_DIS_BLOCK5_S  24
/** EFUSE_WR_DIS_BLOCK6 : RO; bitpos: [25]; default: 0;
 *  Write disable bit 25 for BLOCK6
 */
#define EFUSE_WR_DIS_BLOCK6    (BIT(25))
#define EFUSE_WR_DIS_BLOCK6_M  (EFUSE_WR_DIS_BLOCK6_V << EFUSE_WR_DIS_BLOCK6_S)
#define EFUSE_WR_DIS_BLOCK6_V  0x00000001U
#define EFUSE_WR_DIS_BLOCK6_S  25
/** EFUSE_WR_DIS_BLOCK7 : RO; bitpos: [26]; default: 0;
 *  Write disable bit 26 for BLOCK7
 */
#define EFUSE_WR_DIS_BLOCK7    (BIT(26))
#define EFUSE_WR_DIS_BLOCK7_M  (EFUSE_WR_DIS_BLOCK7_V << EFUSE_WR_DIS_BLOCK7_S)
#define EFUSE_WR_DIS_BLOCK7_V  0x00000001U
#define EFUSE_WR_DIS_BLOCK7_S  26
/** EFUSE_WR_DIS_BLOCK8 : RO; bitpos: [27]; default: 0;
 *  Write disable bit 27 for BLOCK8
 */
#define EFUSE_WR_DIS_BLOCK8    (BIT(27))
#define EFUSE_WR_DIS_BLOCK8_M  (EFUSE_WR_DIS_BLOCK8_V << EFUSE_WR_DIS_BLOCK8_S)
#define EFUSE_WR_DIS_BLOCK8_V  0x00000001U
#define EFUSE_WR_DIS_BLOCK8_S  27
/** EFUSE_WR_DIS_BLOCK9 : RO; bitpos: [28]; default: 0;
 *  Write disable bit 28 for BLOCK9
 */
#define EFUSE_WR_DIS_BLOCK9    (BIT(28))
#define EFUSE_WR_DIS_BLOCK9_M  (EFUSE_WR_DIS_BLOCK9_V << EFUSE_WR_DIS_BLOCK9_S)
#define EFUSE_WR_DIS_BLOCK9_V  0x00000001U
#define EFUSE_WR_DIS_BLOCK9_S  28
/** EFUSE_WR_DIS_29 : RO; bitpos: [29]; default: 0;
 *  reserved
 */
#define EFUSE_WR_DIS_29    (BIT(29))
#define EFUSE_WR_DIS_29_M  (EFUSE_WR_DIS_29_V << EFUSE_WR_DIS_29_S)
#define EFUSE_WR_DIS_29_V  0x00000001U
#define EFUSE_WR_DIS_29_S  29
/** EFUSE_WR_DIS_30 : RO; bitpos: [30]; default: 0;
 *  reserved
 */
#define EFUSE_WR_DIS_30    (BIT(30))
#define EFUSE_WR_DIS_30_M  (EFUSE_WR_DIS_30_V << EFUSE_WR_DIS_30_S)
#define EFUSE_WR_DIS_30_V  0x00000001U
#define EFUSE_WR_DIS_30_S  30
/** EFUSE_WR_DIS_SOFT_DIS_JTAG : RO; bitpos: [31]; default: 0;
 *  Write disable bit 31 for EFUSE_SOFT_DIS_JTAG
 */
#define EFUSE_WR_DIS_SOFT_DIS_JTAG    (BIT(31))
#define EFUSE_WR_DIS_SOFT_DIS_JTAG_M  (EFUSE_WR_DIS_SOFT_DIS_JTAG_V << EFUSE_WR_DIS_SOFT_DIS_JTAG_S)
#define EFUSE_WR_DIS_SOFT_DIS_JTAG_V  0x00000001U
#define EFUSE_WR_DIS_SOFT_DIS_JTAG_S  31

