espressif/esp-idf/components/soc/esp32s31/register/soc/efuse_reg.h
/** EFUSE_RD_REPEAT_DATA0_REG register
 *  Represents rd_repeat_data
 */
#define EFUSE_RD_REPEAT_DATA0_REG (DR_REG_EFUSE_BASE + 0x30)
/** EFUSE_RD_DIS_BLOCK4 : RO; bitpos: [0]; default: 0;
 *  Read disable bit 0 for BLOCK4
 */
#define EFUSE_RD_DIS_BLOCK4    (BIT(0))
#define EFUSE_RD_DIS_BLOCK4_M  (EFUSE_RD_DIS_BLOCK4_V << EFUSE_RD_DIS_BLOCK4_S)
#define EFUSE_RD_DIS_BLOCK4_V  0x00000001U
#define EFUSE_RD_DIS_BLOCK4_S  0
/** EFUSE_RD_DIS_BLOCK5 : RO; bitpos: [1]; default: 0;
 *  Read disable bit 1 for BLOCK5
 */
#define EFUSE_RD_DIS_BLOCK5    (BIT(1))
#define EFUSE_RD_DIS_BLOCK5_M  (EFUSE_RD_DIS_BLOCK5_V << EFUSE_RD_DIS_BLOCK5_S)
#define EFUSE_RD_DIS_BLOCK5_V  0x00000001U
#define EFUSE_RD_DIS_BLOCK5_S  1
/** EFUSE_RD_DIS_BLOCK6 : RO; bitpos: [2]; default: 0;
 *  Read disable bit 2 for BLOCK6
 */
#define EFUSE_RD_DIS_BLOCK6    (BIT(2))
#define EFUSE_RD_DIS_BLOCK6_M  (EFUSE_RD_DIS_BLOCK6_V << EFUSE_RD_DIS_BLOCK6_S)
#define EFUSE_RD_DIS_BLOCK6_V  0x00000001U
#define EFUSE_RD_DIS_BLOCK6_S  2
/** EFUSE_RD_DIS_BLOCK7 : RO; bitpos: [3]; default: 0;
 *  Read disable bit 3 for BLOCK7
 */
#define EFUSE_RD_DIS_BLOCK7    (BIT(3))
#define EFUSE_RD_DIS_BLOCK7_M  (EFUSE_RD_DIS_BLOCK7_V << EFUSE_RD_DIS_BLOCK7_S)
#define EFUSE_RD_DIS_BLOCK7_V  0x00000001U
#define EFUSE_RD_DIS_BLOCK7_S  3
/** EFUSE_RD_DIS_BLOCK8 : RO; bitpos: [4]; default: 0;
 *  Read disable bit 4 for BLOCK8
 */
#define EFUSE_RD_DIS_BLOCK8    (BIT(4))
#define EFUSE_RD_DIS_BLOCK8_M  (EFUSE_RD_DIS_BLOCK8_V << EFUSE_RD_DIS_BLOCK8_S)
#define EFUSE_RD_DIS_BLOCK8_V  0x00000001U
#define EFUSE_RD_DIS_BLOCK8_S  4
/** EFUSE_RD_DIS_BLOCK9 : RO; bitpos: [5]; default: 0;
 *  Read disable bit 5 for BLOCK9
 */
#define EFUSE_RD_DIS_BLOCK9    (BIT(5))
#define EFUSE_RD_DIS_BLOCK9_M  (EFUSE_RD_DIS_BLOCK9_V << EFUSE_RD_DIS_BLOCK9_S)
#define EFUSE_RD_DIS_BLOCK9_V  0x00000001U
#define EFUSE_RD_DIS_BLOCK9_S  5
/** EFUSE_RD_DIS_6 : RO; bitpos: [6]; default: 0;
 *  reserved
 */
#define EFUSE_RD_DIS_6    (BIT(6))
#define EFUSE_RD_DIS_6_M  (EFUSE_RD_DIS_6_V << EFUSE_RD_DIS_6_S)
#define EFUSE_RD_DIS_6_V  0x00000001U
#define EFUSE_RD_DIS_6_S  6
/** EFUSE_RESERVED_0_39 : R; bitpos: [9:7]; default: 0;
 *  reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_RESERVED_0_39    0x00000007U
#define EFUSE_RESERVED_0_39_M  (EFUSE_RESERVED_0_39_V << EFUSE_RESERVED_0_39_S)
#define EFUSE_RESERVED_0_39_V  0x00000007U
#define EFUSE_RESERVED_0_39_S  7
/** EFUSE_DIS_USB_JTAG : RO; bitpos: [10]; default: 0;
 *  Represents whether the function of usb switch to jtag is disabled or enabled.
 *  1: disabled
 *  0: enabled
 */
#define EFUSE_DIS_USB_JTAG    (BIT(10))
#define EFUSE_DIS_USB_JTAG_M  (EFUSE_DIS_USB_JTAG_V << EFUSE_DIS_USB_JTAG_S)
#define EFUSE_DIS_USB_JTAG_V  0x00000001U
#define EFUSE_DIS_USB_JTAG_S  10
/** EFUSE_DIS_USB_SERIAL_JTAG : RO; bitpos: [11]; default: 0;
 *  Represents whether USB-Serial-JTAG is disabled or enabled.
 *  1: disabled
 *  0: enabled
 *
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_DIS_USB_SERIAL_JTAG    (BIT(11))
#define EFUSE_DIS_USB_SERIAL_JTAG_M  (EFUSE_DIS_USB_SERIAL_JTAG_V << EFUSE_DIS_USB_SERIAL_JTAG_S)
#define EFUSE_DIS_USB_SERIAL_JTAG_V  0x00000001U
#define EFUSE_DIS_USB_SERIAL_JTAG_S  11
/** EFUSE_DIS_FORCE_DOWNLOAD : RO; bitpos: [12]; default: 0;
 *  Represents whether the function that forces chip into download mode is disabled or
 *  enabled.
 *  1: disabled
 *  0: enabled
 */
#define EFUSE_DIS_FORCE_DOWNLOAD    (BIT(12))
#define EFUSE_DIS_FORCE_DOWNLOAD_M  (EFUSE_DIS_FORCE_DOWNLOAD_V << EFUSE_DIS_FORCE_DOWNLOAD_S)
#define EFUSE_DIS_FORCE_DOWNLOAD_V  0x00000001U
#define EFUSE_DIS_FORCE_DOWNLOAD_S  12
/** EFUSE_SPI_DOWNLOAD_MSPI_DIS : RO; bitpos: [13]; default: 0;
 *  Represents whether SPI0 controller during boot_mode_download is disabled or enabled.
 *  1: disabled
 *  0: enabled
 */
#define EFUSE_SPI_DOWNLOAD_MSPI_DIS    (BIT(13))
#define EFUSE_SPI_DOWNLOAD_MSPI_DIS_M  (EFUSE_SPI_DOWNLOAD_MSPI_DIS_V << EFUSE_SPI_DOWNLOAD_MSPI_DIS_S)
#define EFUSE_SPI_DOWNLOAD_MSPI_DIS_V  0x00000001U
#define EFUSE_SPI_DOWNLOAD_MSPI_DIS_S  13
/** EFUSE_DIS_TWAI : RO; bitpos: [14]; default: 0;
 *  Represents whether TWAI function is disabled or enabled.
 *  1: disabled
 *  0: enabled
 */
#define EFUSE_DIS_TWAI    (BIT(14))
#define EFUSE_DIS_TWAI_M  (EFUSE_DIS_TWAI_V << EFUSE_DIS_TWAI_S)
#define EFUSE_DIS_TWAI_V  0x00000001U
#define EFUSE_DIS_TWAI_S  14
/** EFUSE_JTAG_SEL_ENABLE : RO; bitpos: [15]; default: 0;
 *  Represents whether the selection between usb_to_jtag and pad_to_jtag through
 *  strapping gpio15 when both EFUSE_DIS_PAD_JTAG and EFUSE_DIS_USB_JTAG are equal to 0
 *  is enabled or disabled.
 *  1: enabled
 *  0: disabled
 */
#define EFUSE_JTAG_SEL_ENABLE    (BIT(15))
#define EFUSE_JTAG_SEL_ENABLE_M  (EFUSE_JTAG_SEL_ENABLE_V << EFUSE_JTAG_SEL_ENABLE_S)
#define EFUSE_JTAG_SEL_ENABLE_V  0x00000001U
#define EFUSE_JTAG_SEL_ENABLE_S  15
/** EFUSE_SOFT_DIS_JTAG : RO; bitpos: [18:16]; default: 0;
 *  Represents whether JTAG is disabled in soft way.
 *  Odd number: disabled
 *  Even number: enabled
 */
#define EFUSE_SOFT_DIS_JTAG    0x00000007U
#define EFUSE_SOFT_DIS_JTAG_M  (EFUSE_SOFT_DIS_JTAG_V << EFUSE_SOFT_DIS_JTAG_S)
#define EFUSE_SOFT_DIS_JTAG_V  0x00000007U
#define EFUSE_SOFT_DIS_JTAG_S  16
/** EFUSE_DIS_PAD_JTAG : RO; bitpos: [19]; default: 0;
 *  Represents whether JTAG is disabled in the hard way(permanently).
 *  1: disabled
 *  0: enabled
 */
#define EFUSE_DIS_PAD_JTAG    (BIT(19))
#define EFUSE_DIS_PAD_JTAG_M  (EFUSE_DIS_PAD_JTAG_V << EFUSE_DIS_PAD_JTAG_S)
#define EFUSE_DIS_PAD_JTAG_V  0x00000001U
#define EFUSE_DIS_PAD_JTAG_S  19
/** EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT : RO; bitpos: [20]; default: 0;
 *  Represents whether flash encrypt function is disabled or enabled(except in SPI boot
 *  mode).
 *  1: disabled
 *  0: enabled
 */
#define EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT    (BIT(20))
#define EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_M  (EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_V << EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_S)
#define EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_V  0x00000001U
#define EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_S  20
/** EFUSE_RESERVED_0_53 : R; bitpos: [21]; default: 0;
 *  reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_RESERVED_0_53    (BIT(21))
#define EFUSE_RESERVED_0_53_M  (EFUSE_RESERVED_0_53_V << EFUSE_RESERVED_0_53_S)
#define EFUSE_RESERVED_0_53_V  0x00000001U
#define EFUSE_RESERVED_0_53_S  21
/** EFUSE_DIS_WIFI6 : RO; bitpos: [22]; default: 0;
 *  Represents whether the WIFI6 feature is enabled or disabled. 1: WIFI6 is disabled;
 *  0: WIFI6 is enabled
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_DIS_WIFI6    (BIT(22))
#define EFUSE_DIS_WIFI6_M  (EFUSE_DIS_WIFI6_V << EFUSE_DIS_WIFI6_S)
#define EFUSE_DIS_WIFI6_V  0x00000001U
#define EFUSE_DIS_WIFI6_S  22
/** EFUSE_HUK_GEN_STATE : RO; bitpos: [27:23]; default: 0;
 *  Represents the control of validation of HUK generate mode. Odd of 1 is invalid,
 *  even of 1 is valid.
 */
#define EFUSE_HUK_GEN_STATE    0x0000001FU
#define EFUSE_HUK_GEN_STATE_M  (EFUSE_HUK_GEN_STATE_V << EFUSE_HUK_GEN_STATE_S)
#define EFUSE_HUK_GEN_STATE_V  0x0000001FU
#define EFUSE_HUK_GEN_STATE_S  23
/** EFUSE_RESERVED_0_60 : R; bitpos: [31:28]; default: 0;
 *  reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_RESERVED_0_60    0x0000000FU
#define EFUSE_RESERVED_0_60_M  (EFUSE_RESERVED_0_60_V << EFUSE_RESERVED_0_60_S)
#define EFUSE_RESERVED_0_60_V  0x0000000FU
#define EFUSE_RESERVED_0_60_S  28

/** EFUSE_RD_REPEAT_DATA1_REG register
 *  Represents rd_repeat_data
 */
#define EFUSE_RD_REPEAT_DATA1_REG (DR_REG_EFUSE_BASE + 0x34)
/** EFUSE_KM_RND_SWITCH_CYCLE : RO; bitpos: [0]; default: 0;
 *  Represents the control of key manager random number switch cycle. 0: control by
 *  register. 1: 8 km clk cycles. 2: 16 km cycles. 3: 32 km cycles
 */
#define EFUSE_KM_RND_SWITCH_CYCLE    (BIT(0))
#define EFUSE_KM_RND_SWITCH_CYCLE_M  (EFUSE_KM_RND_SWITCH_CYCLE_V << EFUSE_KM_RND_SWITCH_CYCLE_S)
#define EFUSE_KM_RND_SWITCH_CYCLE_V  0x00000001U
#define EFUSE_KM_RND_SWITCH_CYCLE_S  0
/** EFUSE_RESERVED_0_65 : R; bitpos: [1]; default: 0;
 *  reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_RESERVED_0_65    (BIT(1))
#define EFUSE_RESERVED_0_65_M  (EFUSE_RESERVED_0_65_V << EFUSE_RESERVED_0_65_S)
#define EFUSE_RESERVED_0_65_V  0x00000001U
#define EFUSE_RESERVED_0_65_S  1
/** EFUSE_KM_DISABLE_DEPLOY_MODE : RO; bitpos: [6:2]; default: 0;
 *  Represents whether the deploy mode of key manager is disable or not.
 *  1: disabled
 *  0: enabled.
 *  bit 0: ecsda, bit 1: flash & spi boot srambler, bit2: hmac & aes, bit3: ds & SDC
 *  nonce, bit4: psram
 */
#define EFUSE_KM_DISABLE_DEPLOY_MODE    0x0000001FU
#define EFUSE_KM_DISABLE_DEPLOY_MODE_M  (EFUSE_KM_DISABLE_DEPLOY_MODE_V << EFUSE_KM_DISABLE_DEPLOY_MODE_S)
#define EFUSE_KM_DISABLE_DEPLOY_MODE_V  0x0000001FU
#define EFUSE_KM_DISABLE_DEPLOY_MODE_S  2
/** EFUSE_KM_DEPLOY_ONLY_ONCE : RO; bitpos: [11:7]; default: 0;
 *  Represents whether corresponding key can only be deployed once. 1 is true, 0 is
 *  false.
 *  0: ecsda
 *  1: flash & spi boot srambler
 *  2: hmac & aes
 *  3: ds & SDC nonce
 *  4: psram
 */
#define EFUSE_KM_DEPLOY_ONLY_ONCE    0x0000001FU
#define EFUSE_KM_DEPLOY_ONLY_ONCE_M  (EFUSE_KM_DEPLOY_ONLY_ONCE_V << EFUSE_KM_DEPLOY_ONLY_ONCE_S)
#define EFUSE_KM_DEPLOY_ONLY_ONCE_V  0x0000001FU
#define EFUSE_KM_DEPLOY_ONLY_ONCE_S  7
/** EFUSE_FORCE_USE_KEY_MANAGER_KEY : RO; bitpos: [16:12]; default: 0;
 *  Represents whether corresponding key must come from key manager. 1 is true, 0 is
 *  false.
 *  0: ecsda
 *  1: flash
 *  2: reserved
 *  3: reserved
 *  4: psram
 */
#define EFUSE_FORCE_USE_KEY_MANAGER_KEY    0x0000001FU
#define EFUSE_FORCE_USE_KEY_MANAGER_KEY_M  (EFUSE_FORCE_USE_KEY_MANAGER_KEY_V << EFUSE_FORCE_USE_KEY_MANAGER_KEY_S)
#define EFUSE_FORCE_USE_KEY_MANAGER_KEY_V  0x0000001FU
#define EFUSE_FORCE_USE_KEY_MANAGER_KEY_S  12
/** EFUSE_FORCE_DISABLE_SW_INIT_KEY : RO; bitpos: [17]; default: 0;
 *  Represents whether to disable software written init key, and force use
 *  efuse_init_key.
 */
#define EFUSE_FORCE_DISABLE_SW_INIT_KEY    (BIT(17))
#define EFUSE_FORCE_DISABLE_SW_INIT_KEY_M  (EFUSE_FORCE_DISABLE_SW_INIT_KEY_V << EFUSE_FORCE_DISABLE_SW_INIT_KEY_S)
#define EFUSE_FORCE_DISABLE_SW_INIT_KEY_V  0x00000001U
#define EFUSE_FORCE_DISABLE_SW_INIT_KEY_S  17
/** EFUSE_KM_XTS_KEY_LENGTH_256 : RO; bitpos: [18]; default: 0;
 *  Represents whether to configure flash encryption use xts-128 key. else use xts-256
 *  key.
 *  0: 128-bit key
 *  1: 256-bit key
 */
#define EFUSE_KM_XTS_KEY_LENGTH_256    (BIT(18))
#define EFUSE_KM_XTS_KEY_LENGTH_256_M  (EFUSE_KM_XTS_KEY_LENGTH_256_V << EFUSE_KM_XTS_KEY_LENGTH_256_S)
#define EFUSE_KM_XTS_KEY_LENGTH_256_V  0x00000001U
#define EFUSE_KM_XTS_KEY_LENGTH_256_S  18
/** EFUSE_WDT_DELAY_SEL : RO; bitpos: [19]; default: 0;
 *  Represents the threshold level of the RTC watchdog STG0 timeout.
 *  0: Original threshold configuration value of STG0 *2
 *  1: Original threshold configuration value of STG0 *4
 *  2: Original threshold configuration value of STG0 *8
 *  3: Original threshold configuration value of STG0 *16
 */
#define EFUSE_WDT_DELAY_SEL    (BIT(19))
#define EFUSE_WDT_DELAY_SEL_M  (EFUSE_WDT_DELAY_SEL_V << EFUSE_WDT_DELAY_SEL_S)
#define EFUSE_WDT_DELAY_SEL_V  0x00000001U
#define EFUSE_WDT_DELAY_SEL_S  19
/** EFUSE_DIS_SM_CRYPT : RO; bitpos: [20]; default: 0;
 *  Represents whether to disable all the SM crypto functions, including SM2, SM3.
 *  1: disabled
 *  0: enabled
 */
#define EFUSE_DIS_SM_CRYPT    (BIT(20))
#define EFUSE_DIS_SM_CRYPT_M  (EFUSE_DIS_SM_CRYPT_V << EFUSE_DIS_SM_CRYPT_S)
#define EFUSE_DIS_SM_CRYPT_V  0x00000001U
#define EFUSE_DIS_SM_CRYPT_S  20
/** EFUSE_SPI_BOOT_CRYPT_CNT : RO; bitpos: [23:21]; default: 0;
 *  Represents whether SPI boot encrypt/decrypt is disabled or enabled.
 *  Odd number of 1: enabled
 *  Even number of 1: disabled
 */
#define EFUSE_SPI_BOOT_CRYPT_CNT    0x00000007U
#define EFUSE_SPI_BOOT_CRYPT_CNT_M  (EFUSE_SPI_BOOT_CRYPT_CNT_V << EFUSE_SPI_BOOT_CRYPT_CNT_S)
#define EFUSE_SPI_BOOT_CRYPT_CNT_V  0x00000007U
#define EFUSE_SPI_BOOT_CRYPT_CNT_S  21
/** EFUSE_SECURE_BOOT_KEY_REVOKE0 : RO; bitpos: [24]; default: 0;
 *  Revoke 1st secure boot key
 */
#define EFUSE_SECURE_BOOT_KEY_REVOKE0    (BIT(24))
#define EFUSE_SECURE_BOOT_KEY_REVOKE0_M  (EFUSE_SECURE_BOOT_KEY_REVOKE0_V << EFUSE_SECURE_BOOT_KEY_REVOKE0_S)
#define EFUSE_SECURE_BOOT_KEY_REVOKE0_V  0x00000001U
#define EFUSE_SECURE_BOOT_KEY_REVOKE0_S  24
/** EFUSE_SECURE_BOOT_KEY_REVOKE1 : RO; bitpos: [25]; default: 0;
 *  Revoke 2nd secure boot key
 */
#define EFUSE_SECURE_BOOT_KEY_REVOKE1    (BIT(25))
#define EFUSE_SECURE_BOOT_KEY_REVOKE1_M  (EFUSE_SECURE_BOOT_KEY_REVOKE1_V << EFUSE_SECURE_BOOT_KEY_REVOKE1_S)
#define EFUSE_SECURE_BOOT_KEY_REVOKE1_V  0x00000001U
#define EFUSE_SECURE_BOOT_KEY_REVOKE1_S  25
/** EFUSE_SECURE_BOOT_KEY_REVOKE2 : RO; bitpos: [26]; default: 0;
 *  Revoke 3rd secure boot key
 */
#define EFUSE_SECURE_BOOT_KEY_REVOKE2    (BIT(26))
#define EFUSE_SECURE_BOOT_KEY_REVOKE2_M  (EFUSE_SECURE_BOOT_KEY_REVOKE2_V << EFUSE_SECURE_BOOT_KEY_REVOKE2_S)
#define EFUSE_SECURE_BOOT_KEY_REVOKE2_V  0x00000001U
#define EFUSE_SECURE_BOOT_KEY_REVOKE2_S  26
/** EFUSE_RESERVED_0_91 : R; bitpos: [31:27]; default: 0;
 *  reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_RESERVED_0_91    0x0000001FU
#define EFUSE_RESERVED_0_91_M  (EFUSE_RESERVED_0_91_V << EFUSE_RESERVED_0_91_S)
#define EFUSE_RESERVED_0_91_V  0x0000001FU
#define EFUSE_RESERVED_0_91_S  27

