espressif/esp-idf/components/soc/esp32s31/register/soc/efuse_reg.h
/** EFUSE_RD_REPEAT_DATA2_REG register
 *  Represents rd_repeat_data
 */
#define EFUSE_RD_REPEAT_DATA2_REG (DR_REG_EFUSE_BASE + 0x38)
/** EFUSE_KEY_PURPOSE_0 : RO; bitpos: [4:0]; default: 0;
 *  Represents the purpose of Key0.
 */
#define EFUSE_KEY_PURPOSE_0    0x0000001FU
#define EFUSE_KEY_PURPOSE_0_M  (EFUSE_KEY_PURPOSE_0_V << EFUSE_KEY_PURPOSE_0_S)
#define EFUSE_KEY_PURPOSE_0_V  0x0000001FU
#define EFUSE_KEY_PURPOSE_0_S  0
/** EFUSE_KEY_PURPOSE_1 : RO; bitpos: [9:5]; default: 0;
 *  Represents the purpose of Key1.
 */
#define EFUSE_KEY_PURPOSE_1    0x0000001FU
#define EFUSE_KEY_PURPOSE_1_M  (EFUSE_KEY_PURPOSE_1_V << EFUSE_KEY_PURPOSE_1_S)
#define EFUSE_KEY_PURPOSE_1_V  0x0000001FU
#define EFUSE_KEY_PURPOSE_1_S  5
/** EFUSE_KEY_PURPOSE_2 : RO; bitpos: [14:10]; default: 0;
 *  Represents the purpose of Key2.
 */
#define EFUSE_KEY_PURPOSE_2    0x0000001FU
#define EFUSE_KEY_PURPOSE_2_M  (EFUSE_KEY_PURPOSE_2_V << EFUSE_KEY_PURPOSE_2_S)
#define EFUSE_KEY_PURPOSE_2_V  0x0000001FU
#define EFUSE_KEY_PURPOSE_2_S  10
/** EFUSE_KEY_PURPOSE_3 : RO; bitpos: [19:15]; default: 0;
 *  Represents the purpose of Key3.
 */
#define EFUSE_KEY_PURPOSE_3    0x0000001FU
#define EFUSE_KEY_PURPOSE_3_M  (EFUSE_KEY_PURPOSE_3_V << EFUSE_KEY_PURPOSE_3_S)
#define EFUSE_KEY_PURPOSE_3_V  0x0000001FU
#define EFUSE_KEY_PURPOSE_3_S  15
/** EFUSE_KEY_PURPOSE_4 : RO; bitpos: [24:20]; default: 0;
 *  Represents the purpose of Key4.
 */
#define EFUSE_KEY_PURPOSE_4    0x0000001FU
#define EFUSE_KEY_PURPOSE_4_M  (EFUSE_KEY_PURPOSE_4_V << EFUSE_KEY_PURPOSE_4_S)
#define EFUSE_KEY_PURPOSE_4_V  0x0000001FU
#define EFUSE_KEY_PURPOSE_4_S  20
/** EFUSE_ECC_FORCE_CONST_TIME : RO; bitpos: [25]; default: 0;
 *  Represents whether permanently turn on ECC const-time mode.
 *  1: turn on
 *  0: turn off
 */
#define EFUSE_ECC_FORCE_CONST_TIME    (BIT(25))
#define EFUSE_ECC_FORCE_CONST_TIME_M  (EFUSE_ECC_FORCE_CONST_TIME_V << EFUSE_ECC_FORCE_CONST_TIME_S)
#define EFUSE_ECC_FORCE_CONST_TIME_V  0x00000001U
#define EFUSE_ECC_FORCE_CONST_TIME_S  25
/** EFUSE_ECDSA_DISABLE_SOFT_K : RO; bitpos: [26]; default: 0;
 *  Represents whether permanently turn off ECDSA software set KEY.
 *  1: turn off
 *  0: turn on
 */
#define EFUSE_ECDSA_DISABLE_SOFT_K    (BIT(26))
#define EFUSE_ECDSA_DISABLE_SOFT_K_M  (EFUSE_ECDSA_DISABLE_SOFT_K_V << EFUSE_ECDSA_DISABLE_SOFT_K_S)
#define EFUSE_ECDSA_DISABLE_SOFT_K_V  0x00000001U
#define EFUSE_ECDSA_DISABLE_SOFT_K_S  26
/** EFUSE_SEC_DPA_LEVEL : RO; bitpos: [28:27]; default: 0;
 *  Represents the spa secure level by configuring the clock random divide mode.
 */
#define EFUSE_SEC_DPA_LEVEL    0x00000003U
#define EFUSE_SEC_DPA_LEVEL_M  (EFUSE_SEC_DPA_LEVEL_V << EFUSE_SEC_DPA_LEVEL_S)
#define EFUSE_SEC_DPA_LEVEL_V  0x00000003U
#define EFUSE_SEC_DPA_LEVEL_S  27
/** EFUSE_XTS_DPA_CLK_ENABLE : RO; bitpos: [29]; default: 0;
 *  Represents whether to enable xts clock anti-dpa attack function.
 *  0: Disabled.
 *  1: Enabled
 */
#define EFUSE_XTS_DPA_CLK_ENABLE    (BIT(29))
#define EFUSE_XTS_DPA_CLK_ENABLE_M  (EFUSE_XTS_DPA_CLK_ENABLE_V << EFUSE_XTS_DPA_CLK_ENABLE_S)
#define EFUSE_XTS_DPA_CLK_ENABLE_V  0x00000001U
#define EFUSE_XTS_DPA_CLK_ENABLE_S  29
/** EFUSE_RESERVED_0_126 : R; bitpos: [31:30]; default: 0;
 *  reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_RESERVED_0_126    0x00000003U
#define EFUSE_RESERVED_0_126_M  (EFUSE_RESERVED_0_126_V << EFUSE_RESERVED_0_126_S)
#define EFUSE_RESERVED_0_126_V  0x00000003U
#define EFUSE_RESERVED_0_126_S  30

/** EFUSE_RD_REPEAT_DATA3_REG register
 *  Represents rd_repeat_data
 */
#define EFUSE_RD_REPEAT_DATA3_REG (DR_REG_EFUSE_BASE + 0x3c)
/** EFUSE_XTS_DPA_PSEUDO_LEVEL : RO; bitpos: [1:0]; default: 0;
 *  Represents the control of the xts pseudo-round anti-dpa attack function. 0:
 *  controlled by register. 1-3: the higher the value is; the more pseudo-rounds are
 *  inserted to the xts-aes calculation
 */
#define EFUSE_XTS_DPA_PSEUDO_LEVEL    0x00000003U
#define EFUSE_XTS_DPA_PSEUDO_LEVEL_M  (EFUSE_XTS_DPA_PSEUDO_LEVEL_V << EFUSE_XTS_DPA_PSEUDO_LEVEL_S)
#define EFUSE_XTS_DPA_PSEUDO_LEVEL_V  0x00000003U
#define EFUSE_XTS_DPA_PSEUDO_LEVEL_S  0
/** EFUSE_SECURE_BOOT_EN : RO; bitpos: [2]; default: 0;
 *  Represents whether secure boot is enabled or disabled.
 *  1: enabled
 *  0: disabled
 */
#define EFUSE_SECURE_BOOT_EN    (BIT(2))
#define EFUSE_SECURE_BOOT_EN_M  (EFUSE_SECURE_BOOT_EN_V << EFUSE_SECURE_BOOT_EN_S)
#define EFUSE_SECURE_BOOT_EN_V  0x00000001U
#define EFUSE_SECURE_BOOT_EN_S  2
/** EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE : RO; bitpos: [3]; default: 0;
 *  Represents whether revoking aggressive secure boot is enabled or disabled.
 *  1: enabled.
 *  0: disabled
 */
#define EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE    (BIT(3))
#define EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_M  (EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_V << EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_S)
#define EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_V  0x00000001U
#define EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_S  3
/** EFUSE_RESERVED_0_132 : R; bitpos: [4]; default: 0;
 *  reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_RESERVED_0_132    (BIT(4))
#define EFUSE_RESERVED_0_132_M  (EFUSE_RESERVED_0_132_V << EFUSE_RESERVED_0_132_S)
#define EFUSE_RESERVED_0_132_V  0x00000001U
#define EFUSE_RESERVED_0_132_S  4
/** EFUSE_FLASH_TYPE : RO; bitpos: [5]; default: 0;
 *  flash type: 0: nor flash, 1: nand flash
 */
#define EFUSE_FLASH_TYPE    (BIT(5))
#define EFUSE_FLASH_TYPE_M  (EFUSE_FLASH_TYPE_V << EFUSE_FLASH_TYPE_S)
#define EFUSE_FLASH_TYPE_V  0x00000001U
#define EFUSE_FLASH_TYPE_S  5
/** EFUSE_RESERVED_0_134 : R; bitpos: [8:6]; default: 0;
 *  reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_RESERVED_0_134    0x00000007U
#define EFUSE_RESERVED_0_134_M  (EFUSE_RESERVED_0_134_V << EFUSE_RESERVED_0_134_S)
#define EFUSE_RESERVED_0_134_V  0x00000007U
#define EFUSE_RESERVED_0_134_S  6
/** EFUSE_DIS_USB_OTG_DOWNLOAD_MODE : RO; bitpos: [9]; default: 0;
 *  Set this bit to disable download via USB-OTG.
 */
#define EFUSE_DIS_USB_OTG_DOWNLOAD_MODE    (BIT(9))
#define EFUSE_DIS_USB_OTG_DOWNLOAD_MODE_M  (EFUSE_DIS_USB_OTG_DOWNLOAD_MODE_V << EFUSE_DIS_USB_OTG_DOWNLOAD_MODE_S)
#define EFUSE_DIS_USB_OTG_DOWNLOAD_MODE_V  0x00000001U
#define EFUSE_DIS_USB_OTG_DOWNLOAD_MODE_S  9
/** EFUSE_RESERVED_0_138 : R; bitpos: [11:10]; default: 0;
 *  reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_RESERVED_0_138    0x00000003U
#define EFUSE_RESERVED_0_138_M  (EFUSE_RESERVED_0_138_V << EFUSE_RESERVED_0_138_S)
#define EFUSE_RESERVED_0_138_V  0x00000003U
#define EFUSE_RESERVED_0_138_S  10
/** EFUSE_FLASH_TPUW : RO; bitpos: [15:12]; default: 0;
 *  Represents the flash waiting time after power-up, in unit of ms. When the value
 *  less than 15, the waiting time is the programmed value. Otherwise, the waiting time
 *  is 2 times the programmed value.
 */
#define EFUSE_FLASH_TPUW    0x0000000FU
#define EFUSE_FLASH_TPUW_M  (EFUSE_FLASH_TPUW_V << EFUSE_FLASH_TPUW_S)
#define EFUSE_FLASH_TPUW_V  0x0000000FU
#define EFUSE_FLASH_TPUW_S  12
/** EFUSE_DIS_DOWNLOAD_MODE : RO; bitpos: [16]; default: 0;
 *  Represents whether Download mode is disabled or enabled.
 *  1: disabled
 *  0: enabled
 */
#define EFUSE_DIS_DOWNLOAD_MODE    (BIT(16))
#define EFUSE_DIS_DOWNLOAD_MODE_M  (EFUSE_DIS_DOWNLOAD_MODE_V << EFUSE_DIS_DOWNLOAD_MODE_S)
#define EFUSE_DIS_DOWNLOAD_MODE_V  0x00000001U
#define EFUSE_DIS_DOWNLOAD_MODE_S  16
/** EFUSE_DIS_DIRECT_BOOT : RO; bitpos: [17]; default: 0;
 *  Represents whether direct boot mode is disabled or enabled.
 *  1: disabled
 *  0: enabled
 */
#define EFUSE_DIS_DIRECT_BOOT    (BIT(17))
#define EFUSE_DIS_DIRECT_BOOT_M  (EFUSE_DIS_DIRECT_BOOT_V << EFUSE_DIS_DIRECT_BOOT_S)
#define EFUSE_DIS_DIRECT_BOOT_V  0x00000001U
#define EFUSE_DIS_DIRECT_BOOT_S  17
/** EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT : RO; bitpos: [18]; default: 0;
 *  Represents whether print from USB-Serial-JTAG is disabled or enabled.
 *  1: disabled
 *  0: enabled
 */
#define EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT    (BIT(18))
#define EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT_M  (EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT_V << EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT_S)
#define EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT_V  0x00000001U
#define EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT_S  18
/** EFUSE_LOCK_KM_KEY : RO; bitpos: [19]; default: 0;
 *  Represetns whether to lock the efuse xts key.
 *  1. Lock
 *  0: Unlock
 */
#define EFUSE_LOCK_KM_KEY    (BIT(19))
#define EFUSE_LOCK_KM_KEY_M  (EFUSE_LOCK_KM_KEY_V << EFUSE_LOCK_KM_KEY_S)
#define EFUSE_LOCK_KM_KEY_V  0x00000001U
#define EFUSE_LOCK_KM_KEY_S  19
/** EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE : RO; bitpos: [20]; default: 0;
 *  Represents whether the USB-Serial-JTAG download function is disabled or enabled.
 *  1: Disable
 *  0: Enable
 */
#define EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE    (BIT(20))
#define EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE_M  (EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE_V << EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE_S)
#define EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE_V  0x00000001U
#define EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE_S  20
/** EFUSE_ENABLE_SECURITY_DOWNLOAD : RO; bitpos: [21]; default: 0;
 *  Represents whether security download is enabled or disabled.
 *  1: enabled
 *  0: disabled
 */
#define EFUSE_ENABLE_SECURITY_DOWNLOAD    (BIT(21))
#define EFUSE_ENABLE_SECURITY_DOWNLOAD_M  (EFUSE_ENABLE_SECURITY_DOWNLOAD_V << EFUSE_ENABLE_SECURITY_DOWNLOAD_S)
#define EFUSE_ENABLE_SECURITY_DOWNLOAD_V  0x00000001U
#define EFUSE_ENABLE_SECURITY_DOWNLOAD_S  21
/** EFUSE_UART_PRINT_CONTROL : RO; bitpos: [23:22]; default: 0;
 *  Represents the type of UART printing.
 *  00: force enable printing
 *  01: enable printing when GPIO8 is reset at low level
 *  10: enable printing when GPIO8 is reset at high level
 *  11: force disable printing
 */
#define EFUSE_UART_PRINT_CONTROL    0x00000003U
#define EFUSE_UART_PRINT_CONTROL_M  (EFUSE_UART_PRINT_CONTROL_V << EFUSE_UART_PRINT_CONTROL_S)
#define EFUSE_UART_PRINT_CONTROL_V  0x00000003U
#define EFUSE_UART_PRINT_CONTROL_S  22
/** EFUSE_FORCE_SEND_RESUME : RO; bitpos: [24]; default: 0;
 *  Represents whether ROM code is forced to send a resume command during SPI boot.
 *  1: forced
 *  0:not forced
 */
#define EFUSE_FORCE_SEND_RESUME    (BIT(24))
#define EFUSE_FORCE_SEND_RESUME_M  (EFUSE_FORCE_SEND_RESUME_V << EFUSE_FORCE_SEND_RESUME_S)
#define EFUSE_FORCE_SEND_RESUME_V  0x00000001U
#define EFUSE_FORCE_SEND_RESUME_S  24
/** EFUSE_RESERVED_0_153 : R; bitpos: [31:25]; default: 0;
 *  reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_RESERVED_0_153    0x0000007FU
#define EFUSE_RESERVED_0_153_M  (EFUSE_RESERVED_0_153_V << EFUSE_RESERVED_0_153_S)
#define EFUSE_RESERVED_0_153_V  0x0000007FU
#define EFUSE_RESERVED_0_153_S  25

/** EFUSE_RD_REPEAT_DATA4_REG register
 *  Represents rd_repeat_data
 */
#define EFUSE_RD_REPEAT_DATA4_REG (DR_REG_EFUSE_BASE + 0x40)
/** EFUSE_SECURE_VERSION : RO; bitpos: [15:0]; default: 0;
 *  Represents the version used by ESP-IDF anti-rollback feature.
 */
#define EFUSE_SECURE_VERSION    0x0000FFFFU
#define EFUSE_SECURE_VERSION_M  (EFUSE_SECURE_VERSION_V << EFUSE_SECURE_VERSION_S)
#define EFUSE_SECURE_VERSION_V  0x0000FFFFU
#define EFUSE_SECURE_VERSION_S  0
/** EFUSE_SECURE_BOOT_DISABLE_FAST_WAKE : RO; bitpos: [16]; default: 0;
 *  Represents whether FAST VERIFY ON WAKE is disabled or enabled when Secure Boot is
 *  enabled.
 *  1: disabled
 *  0: enabled
 */
#define EFUSE_SECURE_BOOT_DISABLE_FAST_WAKE    (BIT(16))
#define EFUSE_SECURE_BOOT_DISABLE_FAST_WAKE_M  (EFUSE_SECURE_BOOT_DISABLE_FAST_WAKE_V << EFUSE_SECURE_BOOT_DISABLE_FAST_WAKE_S)
#define EFUSE_SECURE_BOOT_DISABLE_FAST_WAKE_V  0x00000001U
#define EFUSE_SECURE_BOOT_DISABLE_FAST_WAKE_S  16
/** EFUSE_HYS_EN_PAD : RO; bitpos: [17]; default: 0;
 *  Represents whether the hysteresis function of corresponding PAD is enabled.
 *  1: enabled
 *  0:disabled
 */
#define EFUSE_HYS_EN_PAD    (BIT(17))
#define EFUSE_HYS_EN_PAD_M  (EFUSE_HYS_EN_PAD_V << EFUSE_HYS_EN_PAD_S)
#define EFUSE_HYS_EN_PAD_V  0x00000001U
#define EFUSE_HYS_EN_PAD_S  17
/** EFUSE_RESERVED_0_178 : R; bitpos: [31:18]; default: 0;
 *  reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_RESERVED_0_178    0x00003FFFU
#define EFUSE_RESERVED_0_178_M  (EFUSE_RESERVED_0_178_V << EFUSE_RESERVED_0_178_S)
#define EFUSE_RESERVED_0_178_V  0x00003FFFU
#define EFUSE_RESERVED_0_178_S  18

