espressif/esp-idf/components/soc/esp32s31/register/soc/efuse_reg.h
/** EFUSE_RD_REPEAT_DATA5_REG register
 *  Represents rd_repeat_data
 */
#define EFUSE_RD_REPEAT_DATA5_REG (DR_REG_EFUSE_BASE + 0x44)
/** EFUSE_RESERVED_0_192 : R; bitpos: [1:0]; default: 0;
 *  reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_RESERVED_0_192    0x00000003U
#define EFUSE_RESERVED_0_192_M  (EFUSE_RESERVED_0_192_V << EFUSE_RESERVED_0_192_S)
#define EFUSE_RESERVED_0_192_V  0x00000003U
#define EFUSE_RESERVED_0_192_S  0
/** EFUSE_DCDC_VSET_EN : RO; bitpos: [2]; default: 0;
 *  Select dcdc vset use efuse_dcdc_vset.
 */
#define EFUSE_DCDC_VSET_EN    (BIT(2))
#define EFUSE_DCDC_VSET_EN_M  (EFUSE_DCDC_VSET_EN_V << EFUSE_DCDC_VSET_EN_S)
#define EFUSE_DCDC_VSET_EN_V  0x00000001U
#define EFUSE_DCDC_VSET_EN_S  2
/** EFUSE_DIS_WDT : RO; bitpos: [3]; default: 0;
 *  Set this bit to disable watch dog.
 */
#define EFUSE_DIS_WDT    (BIT(3))
#define EFUSE_DIS_WDT_M  (EFUSE_DIS_WDT_V << EFUSE_DIS_WDT_S)
#define EFUSE_DIS_WDT_V  0x00000001U
#define EFUSE_DIS_WDT_S  3
/** EFUSE_DIS_SWD : RO; bitpos: [4]; default: 0;
 *  Set this bit to disable super-watchdog.
 */
#define EFUSE_DIS_SWD    (BIT(4))
#define EFUSE_DIS_SWD_M  (EFUSE_DIS_SWD_V << EFUSE_DIS_SWD_S)
#define EFUSE_DIS_SWD_V  0x00000001U
#define EFUSE_DIS_SWD_S  4
/** EFUSE_RESERVED_0_197 : R; bitpos: [10:5]; default: 0;
 *  reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_RESERVED_0_197    0x0000003FU
#define EFUSE_RESERVED_0_197_M  (EFUSE_RESERVED_0_197_V << EFUSE_RESERVED_0_197_S)
#define EFUSE_RESERVED_0_197_V  0x0000003FU
#define EFUSE_RESERVED_0_197_S  5
/** EFUSE_SECURE_BOOT_SHA384_EN : RO; bitpos: [11]; default: 0;
 *  Represents whether secure boot using SHA-384 is enabled. 0: Disable 1: Enable
 */
#define EFUSE_SECURE_BOOT_SHA384_EN    (BIT(11))
#define EFUSE_SECURE_BOOT_SHA384_EN_M  (EFUSE_SECURE_BOOT_SHA384_EN_V << EFUSE_SECURE_BOOT_SHA384_EN_S)
#define EFUSE_SECURE_BOOT_SHA384_EN_V  0x00000001U
#define EFUSE_SECURE_BOOT_SHA384_EN_S  11
/** EFUSE_BOOTLOADER_ANTI_ROLLBACK_SECURE_VERSION : RO; bitpos: [15:12]; default: 0;
 *  Represents the anti-rollback secure version of the 2nd stage bootloader used by the
 *  ROM bootloader.
 */
#define EFUSE_BOOTLOADER_ANTI_ROLLBACK_SECURE_VERSION    0x0000000FU
#define EFUSE_BOOTLOADER_ANTI_ROLLBACK_SECURE_VERSION_M  (EFUSE_BOOTLOADER_ANTI_ROLLBACK_SECURE_VERSION_V << EFUSE_BOOTLOADER_ANTI_ROLLBACK_SECURE_VERSION_S)
#define EFUSE_BOOTLOADER_ANTI_ROLLBACK_SECURE_VERSION_V  0x0000000FU
#define EFUSE_BOOTLOADER_ANTI_ROLLBACK_SECURE_VERSION_S  12
/** EFUSE_BOOTLOADER_ANTI_ROLLBACK_EN : RO; bitpos: [16]; default: 0;
 *  Represents whether the ani-rollback check for the 2nd stage bootloader is enabled.
 *  1: Enabled
 *  0: Disabled
 */
#define EFUSE_BOOTLOADER_ANTI_ROLLBACK_EN    (BIT(16))
#define EFUSE_BOOTLOADER_ANTI_ROLLBACK_EN_M  (EFUSE_BOOTLOADER_ANTI_ROLLBACK_EN_V << EFUSE_BOOTLOADER_ANTI_ROLLBACK_EN_S)
#define EFUSE_BOOTLOADER_ANTI_ROLLBACK_EN_V  0x00000001U
#define EFUSE_BOOTLOADER_ANTI_ROLLBACK_EN_S  16
/** EFUSE_BOOTLOADER_ANTI_ROLLBACK_UPDATE_IN_ROM : RO; bitpos: [17]; default: 0;
 *  Represents whether the ani-rollback SECURE_VERSION will be updated from the ROM
 *  bootloader.
 *  1: Enable
 *  0: Disable
 */
#define EFUSE_BOOTLOADER_ANTI_ROLLBACK_UPDATE_IN_ROM    (BIT(17))
#define EFUSE_BOOTLOADER_ANTI_ROLLBACK_UPDATE_IN_ROM_M  (EFUSE_BOOTLOADER_ANTI_ROLLBACK_UPDATE_IN_ROM_V << EFUSE_BOOTLOADER_ANTI_ROLLBACK_UPDATE_IN_ROM_S)
#define EFUSE_BOOTLOADER_ANTI_ROLLBACK_UPDATE_IN_ROM_V  0x00000001U
#define EFUSE_BOOTLOADER_ANTI_ROLLBACK_UPDATE_IN_ROM_S  17
/** EFUSE_RECOVERY_BOOTLOADER_FLASH_SECTOR : RO; bitpos: [29:18]; default: 0;
 *  Represents the starting flash sector (flash sector size is 0x1000) of the recovery
 *  bootloader used by the ROM bootloader If the primary bootloader fails. 0 and 0xFFF
 *  - this feature is disabled.
 */
#define EFUSE_RECOVERY_BOOTLOADER_FLASH_SECTOR    0x00000FFFU
#define EFUSE_RECOVERY_BOOTLOADER_FLASH_SECTOR_M  (EFUSE_RECOVERY_BOOTLOADER_FLASH_SECTOR_V << EFUSE_RECOVERY_BOOTLOADER_FLASH_SECTOR_S)
#define EFUSE_RECOVERY_BOOTLOADER_FLASH_SECTOR_V  0x00000FFFU
#define EFUSE_RECOVERY_BOOTLOADER_FLASH_SECTOR_S  18
/** EFUSE_SDC_ENA : RO; bitpos: [31:30]; default: 0;
 *  Represents whether SDC function is supported in download mode.
 *  2'b01/2'b10: enabled
 *  2'b00/2'b11: disabled
 */
#define EFUSE_SDC_ENA    0x00000003U
#define EFUSE_SDC_ENA_M  (EFUSE_SDC_ENA_V << EFUSE_SDC_ENA_S)
#define EFUSE_SDC_ENA_V  0x00000003U
#define EFUSE_SDC_ENA_S  30

/** EFUSE_RD_REPEAT_DATA6_REG register
 *  Represents rd_repeat_data
 */
#define EFUSE_RD_REPEAT_DATA6_REG (DR_REG_EFUSE_BASE + 0x48)
/** EFUSE_SDC_SESSION_COUNTER : RO; bitpos: [2:0]; default: 0;
 *  Represents the number of times the SDC session has been entered.
 */
#define EFUSE_SDC_SESSION_COUNTER    0x00000007U
#define EFUSE_SDC_SESSION_COUNTER_M  (EFUSE_SDC_SESSION_COUNTER_V << EFUSE_SDC_SESSION_COUNTER_S)
#define EFUSE_SDC_SESSION_COUNTER_V  0x00000007U
#define EFUSE_SDC_SESSION_COUNTER_S  0
/** EFUSE_SDC_NONCE_ENA : RO; bitpos: [4:3]; default: 0;
 *  Represents whether random number NONCE is used in SDC and whether the KM module is
 *  used to generate the NONCE
 *  . 2'bx0: No NONCE
 *  2'b1x: Use KM generate NONCE.
 */
#define EFUSE_SDC_NONCE_ENA    0x00000003U
#define EFUSE_SDC_NONCE_ENA_M  (EFUSE_SDC_NONCE_ENA_V << EFUSE_SDC_NONCE_ENA_S)
#define EFUSE_SDC_NONCE_ENA_V  0x00000003U
#define EFUSE_SDC_NONCE_ENA_S  3
/** EFUSE_SDC_CHIP_INFO_SOURCE : RO; bitpos: [5]; default: 0;
 *  Represents whether HUK_info is selected as the source for calculating CHIP_info in
 *  SDC.
 *  1: use HUK_info
 *  0: use UNIQ_id
 */
#define EFUSE_SDC_CHIP_INFO_SOURCE    (BIT(5))
#define EFUSE_SDC_CHIP_INFO_SOURCE_M  (EFUSE_SDC_CHIP_INFO_SOURCE_V << EFUSE_SDC_CHIP_INFO_SOURCE_S)
#define EFUSE_SDC_CHIP_INFO_SOURCE_V  0x00000001U
#define EFUSE_SDC_CHIP_INFO_SOURCE_S  5
/** EFUSE_SDC_DISABLE_FAST_VEF : RO; bitpos: [6]; default: 0;
 *  Represents whether disable FAST_VEF in SDC session.
 *  1: disable
 *  0: enable
 */
#define EFUSE_SDC_DISABLE_FAST_VEF    (BIT(6))
#define EFUSE_SDC_DISABLE_FAST_VEF_M  (EFUSE_SDC_DISABLE_FAST_VEF_V << EFUSE_SDC_DISABLE_FAST_VEF_S)
#define EFUSE_SDC_DISABLE_FAST_VEF_V  0x00000001U
#define EFUSE_SDC_DISABLE_FAST_VEF_S  6
/** EFUSE_PVT_0_GLITCH_EN : RO; bitpos: [7]; default: 0;
 *  Represents whether to enable PVT power glitch monitor function.
 *  1:Enable.
 *  0:Disable
 */
#define EFUSE_PVT_0_GLITCH_EN    (BIT(7))
#define EFUSE_PVT_0_GLITCH_EN_M  (EFUSE_PVT_0_GLITCH_EN_V << EFUSE_PVT_0_GLITCH_EN_S)
#define EFUSE_PVT_0_GLITCH_EN_V  0x00000001U
#define EFUSE_PVT_0_GLITCH_EN_S  7
/** EFUSE_PVT_0_GLITCH_MODE : RO; bitpos: [9:8]; default: 0;
 *  Use to configure glitch mode
 */
#define EFUSE_PVT_0_GLITCH_MODE    0x00000003U
#define EFUSE_PVT_0_GLITCH_MODE_M  (EFUSE_PVT_0_GLITCH_MODE_V << EFUSE_PVT_0_GLITCH_MODE_S)
#define EFUSE_PVT_0_GLITCH_MODE_V  0x00000003U
#define EFUSE_PVT_0_GLITCH_MODE_S  8
/** EFUSE_PVT_1_GLITCH_EN : RO; bitpos: [10]; default: 0;
 *  Represents whether to enable PVT power glitch monitor function.
 *  1:Enable.
 *  0:Disable
 */
#define EFUSE_PVT_1_GLITCH_EN    (BIT(10))
#define EFUSE_PVT_1_GLITCH_EN_M  (EFUSE_PVT_1_GLITCH_EN_V << EFUSE_PVT_1_GLITCH_EN_S)
#define EFUSE_PVT_1_GLITCH_EN_V  0x00000001U
#define EFUSE_PVT_1_GLITCH_EN_S  10
/** EFUSE_PVT_1_GLITCH_MODE : RO; bitpos: [12:11]; default: 0;
 *  Use to configure glitch mode
 */
#define EFUSE_PVT_1_GLITCH_MODE    0x00000003U
#define EFUSE_PVT_1_GLITCH_MODE_M  (EFUSE_PVT_1_GLITCH_MODE_V << EFUSE_PVT_1_GLITCH_MODE_S)
#define EFUSE_PVT_1_GLITCH_MODE_V  0x00000003U
#define EFUSE_PVT_1_GLITCH_MODE_S  11
/** EFUSE_PMU_FLASH_POWER_SEL : RO; bitpos: [13]; default: 0;
 *  FLASH power select.
 *  1'b1: use 3.3V
 *  1'b0: use 1.8V
 */
#define EFUSE_PMU_FLASH_POWER_SEL    (BIT(13))
#define EFUSE_PMU_FLASH_POWER_SEL_M  (EFUSE_PMU_FLASH_POWER_SEL_V << EFUSE_PMU_FLASH_POWER_SEL_S)
#define EFUSE_PMU_FLASH_POWER_SEL_V  0x00000001U
#define EFUSE_PMU_FLASH_POWER_SEL_S  13
/** EFUSE_PMU_FLASH_POWER_SEL_EN : RO; bitpos: [14]; default: 0;
 *  FLASH power select enable signal. 1'b1 : validates EFUSE_PMU_FLASH_POWER_SEL 1'b0:
 *  invalidates EFUSE_PMU_FLASH_POWER_SEL
 */
#define EFUSE_PMU_FLASH_POWER_SEL_EN    (BIT(14))
#define EFUSE_PMU_FLASH_POWER_SEL_EN_M  (EFUSE_PMU_FLASH_POWER_SEL_EN_V << EFUSE_PMU_FLASH_POWER_SEL_EN_S)
#define EFUSE_PMU_FLASH_POWER_SEL_EN_V  0x00000001U
#define EFUSE_PMU_FLASH_POWER_SEL_EN_S  14
/** EFUSE_POWER_GLITCH_EN : RO; bitpos: [18:15]; default: 0;
 *  set these bit enable power glitch enable
 */
#define EFUSE_POWER_GLITCH_EN    0x0000000FU
#define EFUSE_POWER_GLITCH_EN_M  (EFUSE_POWER_GLITCH_EN_V << EFUSE_POWER_GLITCH_EN_S)
#define EFUSE_POWER_GLITCH_EN_V  0x0000000FU
#define EFUSE_POWER_GLITCH_EN_S  15
/** EFUSE_ENA_XTS_SHADOW : RO; bitpos: [19]; default: 0;
 *  Represents whether to enable XTS-AES shadow core countermeasure against fault
 *  injection attacks.
 *  0: Disabled
 *  1: Enabled
 */
#define EFUSE_ENA_XTS_SHADOW    (BIT(19))
#define EFUSE_ENA_XTS_SHADOW_M  (EFUSE_ENA_XTS_SHADOW_V << EFUSE_ENA_XTS_SHADOW_S)
#define EFUSE_ENA_XTS_SHADOW_V  0x00000001U
#define EFUSE_ENA_XTS_SHADOW_S  19
/** EFUSE_ENA_SPI_BOOT_CRYPT_SCRAMBLER : RO; bitpos: [20]; default: 0;
 *  Represents whether to enable ciphertext scrambler for external memory .
 *  0: Disabled
 *  1: Enabled
 */
#define EFUSE_ENA_SPI_BOOT_CRYPT_SCRAMBLER    (BIT(20))
#define EFUSE_ENA_SPI_BOOT_CRYPT_SCRAMBLER_M  (EFUSE_ENA_SPI_BOOT_CRYPT_SCRAMBLER_V << EFUSE_ENA_SPI_BOOT_CRYPT_SCRAMBLER_S)
#define EFUSE_ENA_SPI_BOOT_CRYPT_SCRAMBLER_V  0x00000001U
#define EFUSE_ENA_SPI_BOOT_CRYPT_SCRAMBLER_S  20
/** EFUSE_RE_ENABLE_JTAG_SOURCE : RO; bitpos: [21]; default: 0;
 *  Represents which Crypto peripheral is selected for re-enabling JTAG.
 *  0: SDC
 *  1: HMAC
 */
#define EFUSE_RE_ENABLE_JTAG_SOURCE    (BIT(21))
#define EFUSE_RE_ENABLE_JTAG_SOURCE_M  (EFUSE_RE_ENABLE_JTAG_SOURCE_V << EFUSE_RE_ENABLE_JTAG_SOURCE_S)
#define EFUSE_RE_ENABLE_JTAG_SOURCE_V  0x00000001U
#define EFUSE_RE_ENABLE_JTAG_SOURCE_S  21
/** EFUSE_RESERVED_0_246 : R; bitpos: [31:22]; default: 0;
 *  reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_RESERVED_0_246    0x000003FFU
#define EFUSE_RESERVED_0_246_M  (EFUSE_RESERVED_0_246_V << EFUSE_RESERVED_0_246_S)
#define EFUSE_RESERVED_0_246_V  0x000003FFU
#define EFUSE_RESERVED_0_246_S  22

/** EFUSE_RD_REPEAT_DATA7_REG register
 *  Represents rd_repeat_data
 */
#define EFUSE_RD_REPEAT_DATA7_REG (DR_REG_EFUSE_BASE + 0x4c)
/** EFUSE_REPEAT7_RSVD : RO; bitpos: [15:0]; default: 0;
 *  Reserved.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_REPEAT7_RSVD    0x0000FFFFU
#define EFUSE_REPEAT7_RSVD_M  (EFUSE_REPEAT7_RSVD_V << EFUSE_REPEAT7_RSVD_S)
#define EFUSE_REPEAT7_RSVD_V  0x0000FFFFU
#define EFUSE_REPEAT7_RSVD_S  0
/** EFUSE_RESERVED_0_272 : R; bitpos: [31:16]; default: 0;
 *  reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_RESERVED_0_272    0x0000FFFFU
#define EFUSE_RESERVED_0_272_M  (EFUSE_RESERVED_0_272_V << EFUSE_RESERVED_0_272_S)
#define EFUSE_RESERVED_0_272_V  0x0000FFFFU
#define EFUSE_RESERVED_0_272_S  16

