espressif/esp-idf/components/soc/esp32s31/register/soc/efuse_reg.h
/** EFUSE_RD_KEY4_DATA7_REG register
 *  Represents rd_key4_data7
 */
#define EFUSE_RD_KEY4_DATA7_REG (DR_REG_EFUSE_BASE + 0x144)
/** EFUSE_KEY4_DATA7 : RO; bitpos: [31:0]; default: 0;
 *  Represents the zeroth 32-bit of key4.
 */
#define EFUSE_KEY4_DATA7    0xFFFFFFFFU
#define EFUSE_KEY4_DATA7_M  (EFUSE_KEY4_DATA7_V << EFUSE_KEY4_DATA7_S)
#define EFUSE_KEY4_DATA7_V  0xFFFFFFFFU
#define EFUSE_KEY4_DATA7_S  0

/** EFUSE_RD_SYS_PART2_DATA0_REG register
 *  Represents rd_sys_part2_data
 */
#define EFUSE_RD_SYS_PART2_DATA0_REG (DR_REG_EFUSE_BASE + 0x148)
/** EFUSE_ADC1_DIFF_K : R; bitpos: [10:0]; default: 0;
 *  Fitted slope (K) of ADC1 in differential mode
 */
#define EFUSE_ADC1_DIFF_K    0x000007FFU
#define EFUSE_ADC1_DIFF_K_M  (EFUSE_ADC1_DIFF_K_V << EFUSE_ADC1_DIFF_K_S)
#define EFUSE_ADC1_DIFF_K_V  0x000007FFU
#define EFUSE_ADC1_DIFF_K_S  0
/** EFUSE_ADC1_DIFF_B : R; bitpos: [20:11]; default: 0;
 *  Intercept (B) of ADC1 in differential mode
 */
#define EFUSE_ADC1_DIFF_B    0x000003FFU
#define EFUSE_ADC1_DIFF_B_M  (EFUSE_ADC1_DIFF_B_V << EFUSE_ADC1_DIFF_B_S)
#define EFUSE_ADC1_DIFF_B_V  0x000003FFU
#define EFUSE_ADC1_DIFF_B_S  11
/** EFUSE_ADC1_P_K : R; bitpos: [31:21]; default: 0;
 *  Fitted slope (K) of ADC1 in P mode
 */
#define EFUSE_ADC1_P_K    0x000007FFU
#define EFUSE_ADC1_P_K_M  (EFUSE_ADC1_P_K_V << EFUSE_ADC1_P_K_S)
#define EFUSE_ADC1_P_K_V  0x000007FFU
#define EFUSE_ADC1_P_K_S  21

/** EFUSE_RD_SYS_PART2_DATA1_REG register
 *  Represents rd_sys_part2_data
 */
#define EFUSE_RD_SYS_PART2_DATA1_REG (DR_REG_EFUSE_BASE + 0x14c)
/** EFUSE_ADC1_P_B : R; bitpos: [9:0]; default: 0;
 *  Intercept (B) of ADC1 in P mode
 */
#define EFUSE_ADC1_P_B    0x000003FFU
#define EFUSE_ADC1_P_B_M  (EFUSE_ADC1_P_B_V << EFUSE_ADC1_P_B_S)
#define EFUSE_ADC1_P_B_V  0x000003FFU
#define EFUSE_ADC1_P_B_S  0
/** EFUSE_ADC1_N_K : R; bitpos: [20:10]; default: 0;
 *  Fitted slope (K) of ADC1 in N mode
 */
#define EFUSE_ADC1_N_K    0x000007FFU
#define EFUSE_ADC1_N_K_M  (EFUSE_ADC1_N_K_V << EFUSE_ADC1_N_K_S)
#define EFUSE_ADC1_N_K_V  0x000007FFU
#define EFUSE_ADC1_N_K_S  10
/** EFUSE_ADC1_N_B : R; bitpos: [30:21]; default: 0;
 *  Intercept (B) of ADC1 in N mode
 */
#define EFUSE_ADC1_N_B    0x000003FFU
#define EFUSE_ADC1_N_B_M  (EFUSE_ADC1_N_B_V << EFUSE_ADC1_N_B_S)
#define EFUSE_ADC1_N_B_V  0x000003FFU
#define EFUSE_ADC1_N_B_S  21
/** EFUSE_ADC2_DIFF_K : R; bitpos: [31]; default: 0;
 *  Fitted slope (K) of ADC2 in differential mode
 */
#define EFUSE_ADC2_DIFF_K    (BIT(31))
#define EFUSE_ADC2_DIFF_K_M  (EFUSE_ADC2_DIFF_K_V << EFUSE_ADC2_DIFF_K_S)
#define EFUSE_ADC2_DIFF_K_V  0x00000001U
#define EFUSE_ADC2_DIFF_K_S  31

/** EFUSE_RD_SYS_PART2_DATA2_REG register
 *  Represents rd_sys_part2_data
 */
#define EFUSE_RD_SYS_PART2_DATA2_REG (DR_REG_EFUSE_BASE + 0x150)
/** EFUSE_ADC2_DIFF_K_1 : R; bitpos: [9:0]; default: 0;
 *  Fitted slope (K) of ADC2 in differential mode
 */
#define EFUSE_ADC2_DIFF_K_1    0x000003FFU
#define EFUSE_ADC2_DIFF_K_1_M  (EFUSE_ADC2_DIFF_K_1_V << EFUSE_ADC2_DIFF_K_1_S)
#define EFUSE_ADC2_DIFF_K_1_V  0x000003FFU
#define EFUSE_ADC2_DIFF_K_1_S  0
/** EFUSE_ADC2_DIFF_B : R; bitpos: [19:10]; default: 0;
 *  Intercept (B) of ADC2 in differential mode
 */
#define EFUSE_ADC2_DIFF_B    0x000003FFU
#define EFUSE_ADC2_DIFF_B_M  (EFUSE_ADC2_DIFF_B_V << EFUSE_ADC2_DIFF_B_S)
#define EFUSE_ADC2_DIFF_B_V  0x000003FFU
#define EFUSE_ADC2_DIFF_B_S  10
/** EFUSE_ADC2_P_K : R; bitpos: [30:20]; default: 0;
 *  Fitted slope (K) of ADC2 in P mode
 */
#define EFUSE_ADC2_P_K    0x000007FFU
#define EFUSE_ADC2_P_K_M  (EFUSE_ADC2_P_K_V << EFUSE_ADC2_P_K_S)
#define EFUSE_ADC2_P_K_V  0x000007FFU
#define EFUSE_ADC2_P_K_S  20
/** EFUSE_ADC2_P_B : R; bitpos: [31]; default: 0;
 *  Intercept (B) of ADC2 in P mode
 */
#define EFUSE_ADC2_P_B    (BIT(31))
#define EFUSE_ADC2_P_B_M  (EFUSE_ADC2_P_B_V << EFUSE_ADC2_P_B_S)
#define EFUSE_ADC2_P_B_V  0x00000001U
#define EFUSE_ADC2_P_B_S  31

/** EFUSE_RD_SYS_PART2_DATA3_REG register
 *  Represents rd_sys_part2_data
 */
#define EFUSE_RD_SYS_PART2_DATA3_REG (DR_REG_EFUSE_BASE + 0x154)
/** EFUSE_ADC2_P_B_1 : R; bitpos: [8:0]; default: 0;
 *  Intercept (B) of ADC2 in P mode
 */
#define EFUSE_ADC2_P_B_1    0x000001FFU
#define EFUSE_ADC2_P_B_1_M  (EFUSE_ADC2_P_B_1_V << EFUSE_ADC2_P_B_1_S)
#define EFUSE_ADC2_P_B_1_V  0x000001FFU
#define EFUSE_ADC2_P_B_1_S  0
/** EFUSE_ADC2_N_K : R; bitpos: [19:9]; default: 0;
 *  Fitted slope (K) of ADC2 in N mode
 */
#define EFUSE_ADC2_N_K    0x000007FFU
#define EFUSE_ADC2_N_K_M  (EFUSE_ADC2_N_K_V << EFUSE_ADC2_N_K_S)
#define EFUSE_ADC2_N_K_V  0x000007FFU
#define EFUSE_ADC2_N_K_S  9
/** EFUSE_ADC2_N_B : R; bitpos: [29:20]; default: 0;
 *  Intercept (B) of ADC2 in N mode
 */
#define EFUSE_ADC2_N_B    0x000003FFU
#define EFUSE_ADC2_N_B_M  (EFUSE_ADC2_N_B_V << EFUSE_ADC2_N_B_S)
#define EFUSE_ADC2_N_B_V  0x000003FFU
#define EFUSE_ADC2_N_B_S  20
/** EFUSE_RESERVED_9_126 : R; bitpos: [31:30]; default: 0;
 *  reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_RESERVED_9_126    0x00000003U
#define EFUSE_RESERVED_9_126_M  (EFUSE_RESERVED_9_126_V << EFUSE_RESERVED_9_126_S)
#define EFUSE_RESERVED_9_126_V  0x00000003U
#define EFUSE_RESERVED_9_126_S  30

/** EFUSE_RD_SYS_PART2_DATA4_REG register
 *  Represents rd_sys_part2_data
 */
#define EFUSE_RD_SYS_PART2_DATA4_REG (DR_REG_EFUSE_BASE + 0x158)
/** EFUSE_SYS_DATA_PART2_4 : RO; bitpos: [31:0]; default: 0;
 *  Represents the fourth 32-bit of second part of system data.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_SYS_DATA_PART2_4    0xFFFFFFFFU
#define EFUSE_SYS_DATA_PART2_4_M  (EFUSE_SYS_DATA_PART2_4_V << EFUSE_SYS_DATA_PART2_4_S)
#define EFUSE_SYS_DATA_PART2_4_V  0xFFFFFFFFU
#define EFUSE_SYS_DATA_PART2_4_S  0

/** EFUSE_RD_SYS_PART2_DATA5_REG register
 *  Represents rd_sys_part2_data
 */
#define EFUSE_RD_SYS_PART2_DATA5_REG (DR_REG_EFUSE_BASE + 0x15c)
/** EFUSE_SYS_DATA_PART2_5 : RO; bitpos: [31:0]; default: 0;
 *  Represents the fifth 32-bit of second part of system data.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_SYS_DATA_PART2_5    0xFFFFFFFFU
#define EFUSE_SYS_DATA_PART2_5_M  (EFUSE_SYS_DATA_PART2_5_V << EFUSE_SYS_DATA_PART2_5_S)
#define EFUSE_SYS_DATA_PART2_5_V  0xFFFFFFFFU
#define EFUSE_SYS_DATA_PART2_5_S  0

/** EFUSE_RD_SYS_PART2_DATA6_REG register
 *  Represents rd_sys_part2_data
 */
#define EFUSE_RD_SYS_PART2_DATA6_REG (DR_REG_EFUSE_BASE + 0x160)
/** EFUSE_USB_DEVICE_EXCHG_PINS : RO; bitpos: [0]; default: 0;
 *  Represents whether enable usb device exchange pins of D+ and D- or not.
 *  1: enabled
 *  0: disabled
 */
#define EFUSE_USB_DEVICE_EXCHG_PINS    (BIT(0))
#define EFUSE_USB_DEVICE_EXCHG_PINS_M  (EFUSE_USB_DEVICE_EXCHG_PINS_V << EFUSE_USB_DEVICE_EXCHG_PINS_S)
#define EFUSE_USB_DEVICE_EXCHG_PINS_V  0x00000001U
#define EFUSE_USB_DEVICE_EXCHG_PINS_S  0
/** EFUSE_USB_DEVICE_DREFH : RO; bitpos: [2:1]; default: 0;
 *  Represents the single-end input threshold vrefh, 1.76 V to 2 V with step of 80 mV.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_USB_DEVICE_DREFH    0x00000003U
#define EFUSE_USB_DEVICE_DREFH_M  (EFUSE_USB_DEVICE_DREFH_V << EFUSE_USB_DEVICE_DREFH_S)
#define EFUSE_USB_DEVICE_DREFH_V  0x00000003U
#define EFUSE_USB_DEVICE_DREFH_S  1
/** EFUSE_USB_DEVICE_DREFL : RO; bitpos: [4:3]; default: 0;
 *  Represents the usb device single-end input low threshold, 0.8 V to 1.04 V with step
 *  of 80 mV.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_USB_DEVICE_DREFL    0x00000003U
#define EFUSE_USB_DEVICE_DREFL_M  (EFUSE_USB_DEVICE_DREFL_V << EFUSE_USB_DEVICE_DREFL_S)
#define EFUSE_USB_DEVICE_DREFL_V  0x00000003U
#define EFUSE_USB_DEVICE_DREFL_S  3
/** EFUSE_RESERVED_9_197 : R; bitpos: [16:5]; default: 0;
 *  reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_RESERVED_9_197    0x00000FFFU
#define EFUSE_RESERVED_9_197_M  (EFUSE_RESERVED_9_197_V << EFUSE_RESERVED_9_197_S)
#define EFUSE_RESERVED_9_197_V  0x00000FFFU
#define EFUSE_RESERVED_9_197_S  5
/** EFUSE_PVT_0_CELL_SELECT : RO; bitpos: [23:17]; default: 0;
 *  Power glitch monitor PVT cell select.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_PVT_0_CELL_SELECT    0x0000007FU
#define EFUSE_PVT_0_CELL_SELECT_M  (EFUSE_PVT_0_CELL_SELECT_V << EFUSE_PVT_0_CELL_SELECT_S)
#define EFUSE_PVT_0_CELL_SELECT_V  0x0000007FU
#define EFUSE_PVT_0_CELL_SELECT_S  17
/** EFUSE_PVT_1_CELL_SELECT : RO; bitpos: [30:24]; default: 0;
 *  Power glitch monitor PVT cell select.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_PVT_1_CELL_SELECT    0x0000007FU
#define EFUSE_PVT_1_CELL_SELECT_M  (EFUSE_PVT_1_CELL_SELECT_V << EFUSE_PVT_1_CELL_SELECT_S)
#define EFUSE_PVT_1_CELL_SELECT_V  0x0000007FU
#define EFUSE_PVT_1_CELL_SELECT_S  24
/** EFUSE_RESERVED_9_223 : R; bitpos: [31]; default: 0;
 *  reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_RESERVED_9_223    (BIT(31))
#define EFUSE_RESERVED_9_223_M  (EFUSE_RESERVED_9_223_V << EFUSE_RESERVED_9_223_S)
#define EFUSE_RESERVED_9_223_V  0x00000001U
#define EFUSE_RESERVED_9_223_S  31

/** EFUSE_RD_SYS_PART2_DATA7_REG register
 *  Represents rd_sys_part2_data
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define EFUSE_RD_SYS_PART2_DATA7_REG (DR_REG_EFUSE_BASE + 0x164)
/** EFUSE_PVT_0_LIMIT : RO; bitpos: [15:0]; default: 0;
 *  Power glitch monitor threthold.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_PVT_0_LIMIT    0x0000FFFFU
#define EFUSE_PVT_0_LIMIT_M  (EFUSE_PVT_0_LIMIT_V << EFUSE_PVT_0_LIMIT_S)
#define EFUSE_PVT_0_LIMIT_V  0x0000FFFFU
#define EFUSE_PVT_0_LIMIT_S  0
/** EFUSE_PVT_1_LIMIT : RO; bitpos: [31:16]; default: 0;
 *  Power glitch monitor threthold.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_PVT_1_LIMIT    0x0000FFFFU
#define EFUSE_PVT_1_LIMIT_M  (EFUSE_PVT_1_LIMIT_V << EFUSE_PVT_1_LIMIT_S)
#define EFUSE_PVT_1_LIMIT_V  0x0000FFFFU
#define EFUSE_PVT_1_LIMIT_S  16

/** EFUSE_RD_REPEAT_DATA_ERR0_REG register
 *  Represents rd_repeat_data_err
 */
#define EFUSE_RD_REPEAT_DATA_ERR0_REG (DR_REG_EFUSE_BASE + 0x168)
/** EFUSE_RD_DIS_ERR : RO; bitpos: [6:0]; default: 0;
 *  Represents the programming error of EFUSE_RD_DIS
 */
#define EFUSE_RD_DIS_ERR    0x0000007FU
#define EFUSE_RD_DIS_ERR_M  (EFUSE_RD_DIS_ERR_V << EFUSE_RD_DIS_ERR_S)
#define EFUSE_RD_DIS_ERR_V  0x0000007FU
#define EFUSE_RD_DIS_ERR_S  0
/** EFUSE_DIS_USB_JTAG_ERR : RO; bitpos: [10]; default: 0;
 *  Represents the programming error of EFUSE_DIS_USB_JTAG
 */
#define EFUSE_DIS_USB_JTAG_ERR    (BIT(10))
#define EFUSE_DIS_USB_JTAG_ERR_M  (EFUSE_DIS_USB_JTAG_ERR_V << EFUSE_DIS_USB_JTAG_ERR_S)
#define EFUSE_DIS_USB_JTAG_ERR_V  0x00000001U
#define EFUSE_DIS_USB_JTAG_ERR_S  10
/** EFUSE_DIS_USB_SERIAL_JTAG_ERR : RO; bitpos: [11]; default: 0;
 *  Represents the programming error of EFUSE_DIS_USB_SERIAL_JTAG
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_DIS_USB_SERIAL_JTAG_ERR    (BIT(11))
#define EFUSE_DIS_USB_SERIAL_JTAG_ERR_M  (EFUSE_DIS_USB_SERIAL_JTAG_ERR_V << EFUSE_DIS_USB_SERIAL_JTAG_ERR_S)
#define EFUSE_DIS_USB_SERIAL_JTAG_ERR_V  0x00000001U
#define EFUSE_DIS_USB_SERIAL_JTAG_ERR_S  11
/** EFUSE_DIS_FORCE_DOWNLOAD_ERR : RO; bitpos: [12]; default: 0;
 *  Represents the programming error of EFUSE_DIS_FORCE_DOWNLOAD
 */
#define EFUSE_DIS_FORCE_DOWNLOAD_ERR    (BIT(12))
#define EFUSE_DIS_FORCE_DOWNLOAD_ERR_M  (EFUSE_DIS_FORCE_DOWNLOAD_ERR_V << EFUSE_DIS_FORCE_DOWNLOAD_ERR_S)
#define EFUSE_DIS_FORCE_DOWNLOAD_ERR_V  0x00000001U
#define EFUSE_DIS_FORCE_DOWNLOAD_ERR_S  12
/** EFUSE_SPI_DOWNLOAD_MSPI_DIS_ERR : RO; bitpos: [13]; default: 0;
 *  Represents the programming error of EFUSE_SPI_DOWNLOAD_MSPI_DIS
 */
#define EFUSE_SPI_DOWNLOAD_MSPI_DIS_ERR    (BIT(13))
#define EFUSE_SPI_DOWNLOAD_MSPI_DIS_ERR_M  (EFUSE_SPI_DOWNLOAD_MSPI_DIS_ERR_V << EFUSE_SPI_DOWNLOAD_MSPI_DIS_ERR_S)
#define EFUSE_SPI_DOWNLOAD_MSPI_DIS_ERR_V  0x00000001U
#define EFUSE_SPI_DOWNLOAD_MSPI_DIS_ERR_S  13
/** EFUSE_DIS_TWAI_ERR : RO; bitpos: [14]; default: 0;
 *  Represents the programming error of EFUSE_DIS_TWAI
 */
#define EFUSE_DIS_TWAI_ERR    (BIT(14))
#define EFUSE_DIS_TWAI_ERR_M  (EFUSE_DIS_TWAI_ERR_V << EFUSE_DIS_TWAI_ERR_S)
#define EFUSE_DIS_TWAI_ERR_V  0x00000001U
#define EFUSE_DIS_TWAI_ERR_S  14
/** EFUSE_JTAG_SEL_ENABLE_ERR : RO; bitpos: [15]; default: 0;
 *  Represents the programming error of EFUSE_JTAG_SEL_ENABLE
 */
#define EFUSE_JTAG_SEL_ENABLE_ERR    (BIT(15))
#define EFUSE_JTAG_SEL_ENABLE_ERR_M  (EFUSE_JTAG_SEL_ENABLE_ERR_V << EFUSE_JTAG_SEL_ENABLE_ERR_S)
#define EFUSE_JTAG_SEL_ENABLE_ERR_V  0x00000001U
#define EFUSE_JTAG_SEL_ENABLE_ERR_S  15
/** EFUSE_SOFT_DIS_JTAG_ERR : RO; bitpos: [18:16]; default: 0;
 *  Represents the programming error of EFUSE_SOFT_DIS_JTAG
 */
#define EFUSE_SOFT_DIS_JTAG_ERR    0x00000007U
#define EFUSE_SOFT_DIS_JTAG_ERR_M  (EFUSE_SOFT_DIS_JTAG_ERR_V << EFUSE_SOFT_DIS_JTAG_ERR_S)
#define EFUSE_SOFT_DIS_JTAG_ERR_V  0x00000007U
#define EFUSE_SOFT_DIS_JTAG_ERR_S  16
/** EFUSE_DIS_PAD_JTAG_ERR : RO; bitpos: [19]; default: 0;
 *  Represents the programming error of EFUSE_DIS_PAD_JTAG
 */
#define EFUSE_DIS_PAD_JTAG_ERR    (BIT(19))
#define EFUSE_DIS_PAD_JTAG_ERR_M  (EFUSE_DIS_PAD_JTAG_ERR_V << EFUSE_DIS_PAD_JTAG_ERR_S)
#define EFUSE_DIS_PAD_JTAG_ERR_V  0x00000001U
#define EFUSE_DIS_PAD_JTAG_ERR_S  19
/** EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR : RO; bitpos: [20]; default: 0;
 *  Represents the programming error of EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT
 */
#define EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR    (BIT(20))
#define EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR_M  (EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR_V << EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR_S)
#define EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR_V  0x00000001U
#define EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR_S  20
/** EFUSE_DIS_WIFI6_ERR : RO; bitpos: [22]; default: 0;
 *  Represents the programming error of EFUSE_DIS_WIFI6
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define EFUSE_DIS_WIFI6_ERR    (BIT(22))
#define EFUSE_DIS_WIFI6_ERR_M  (EFUSE_DIS_WIFI6_ERR_V << EFUSE_DIS_WIFI6_ERR_S)
#define EFUSE_DIS_WIFI6_ERR_V  0x00000001U
#define EFUSE_DIS_WIFI6_ERR_S  22
/** EFUSE_HUK_GEN_STATE_ERR : RO; bitpos: [27:23]; default: 0;
 *  Represents the programming error of EFUSE_HUK_GEN_STATE
 */
#define EFUSE_HUK_GEN_STATE_ERR    0x0000001FU
#define EFUSE_HUK_GEN_STATE_ERR_M  (EFUSE_HUK_GEN_STATE_ERR_V << EFUSE_HUK_GEN_STATE_ERR_S)
#define EFUSE_HUK_GEN_STATE_ERR_V  0x0000001FU
#define EFUSE_HUK_GEN_STATE_ERR_S  23

