espressif/esp-idf/components/soc/esp32s31/register/soc/efuse_reg.h
/** EFUSE_RD_REPEAT_DATA_ERR6_REG register
 *  Represents rd_repeat_data_err
 */
#define EFUSE_RD_REPEAT_DATA_ERR6_REG (DR_REG_EFUSE_BASE + 0x180)
/** EFUSE_RMA_SESSION_COUNTER_ERR : RO; bitpos: [2:0]; default: 0;
 *  Represents the programming error of EFUSE_RMA_SESSION_COUNTER
 */
#define EFUSE_RMA_SESSION_COUNTER_ERR    0x00000007U
#define EFUSE_RMA_SESSION_COUNTER_ERR_M  (EFUSE_RMA_SESSION_COUNTER_ERR_V << EFUSE_RMA_SESSION_COUNTER_ERR_S)
#define EFUSE_RMA_SESSION_COUNTER_ERR_V  0x00000007U
#define EFUSE_RMA_SESSION_COUNTER_ERR_S  0
/** EFUSE_RMA_NONCE_ENA_ERR : RO; bitpos: [4:3]; default: 0;
 *  Represents the programming error of EFUSE_RMA_NONCE_ENA
 */
#define EFUSE_RMA_NONCE_ENA_ERR    0x00000003U
#define EFUSE_RMA_NONCE_ENA_ERR_M  (EFUSE_RMA_NONCE_ENA_ERR_V << EFUSE_RMA_NONCE_ENA_ERR_S)
#define EFUSE_RMA_NONCE_ENA_ERR_V  0x00000003U
#define EFUSE_RMA_NONCE_ENA_ERR_S  3
/** EFUSE_RMA_CHIP_INFO_SOURCE_ERR : RO; bitpos: [5]; default: 0;
 *  Represents the programming error of EFUSE_RMA_CHIP_INFO_SOURCE
 */
#define EFUSE_RMA_CHIP_INFO_SOURCE_ERR    (BIT(5))
#define EFUSE_RMA_CHIP_INFO_SOURCE_ERR_M  (EFUSE_RMA_CHIP_INFO_SOURCE_ERR_V << EFUSE_RMA_CHIP_INFO_SOURCE_ERR_S)
#define EFUSE_RMA_CHIP_INFO_SOURCE_ERR_V  0x00000001U
#define EFUSE_RMA_CHIP_INFO_SOURCE_ERR_S  5
/** EFUSE_RMA_DISABLE_FAST_VEF_ERR : RO; bitpos: [6]; default: 0;
 *  Represents the programming error of EFUSE_RMA_DISABLE_FAST_VEF
 */
#define EFUSE_RMA_DISABLE_FAST_VEF_ERR    (BIT(6))
#define EFUSE_RMA_DISABLE_FAST_VEF_ERR_M  (EFUSE_RMA_DISABLE_FAST_VEF_ERR_V << EFUSE_RMA_DISABLE_FAST_VEF_ERR_S)
#define EFUSE_RMA_DISABLE_FAST_VEF_ERR_V  0x00000001U
#define EFUSE_RMA_DISABLE_FAST_VEF_ERR_S  6
/** EFUSE_PVT_0_GLITCH_EN_ERR : RO; bitpos: [7]; default: 0;
 *  Represents the programming error of EFUSE_PVT_0_GLITCH_EN
 */
#define EFUSE_PVT_0_GLITCH_EN_ERR    (BIT(7))
#define EFUSE_PVT_0_GLITCH_EN_ERR_M  (EFUSE_PVT_0_GLITCH_EN_ERR_V << EFUSE_PVT_0_GLITCH_EN_ERR_S)
#define EFUSE_PVT_0_GLITCH_EN_ERR_V  0x00000001U
#define EFUSE_PVT_0_GLITCH_EN_ERR_S  7
/** EFUSE_PVT_0_GLITCH_MODE_ERR : RO; bitpos: [9:8]; default: 0;
 *  Represents the programming error of EFUSE_PVT_0_GLITCH_MODE
 */
#define EFUSE_PVT_0_GLITCH_MODE_ERR    0x00000003U
#define EFUSE_PVT_0_GLITCH_MODE_ERR_M  (EFUSE_PVT_0_GLITCH_MODE_ERR_V << EFUSE_PVT_0_GLITCH_MODE_ERR_S)
#define EFUSE_PVT_0_GLITCH_MODE_ERR_V  0x00000003U
#define EFUSE_PVT_0_GLITCH_MODE_ERR_S  8
/** EFUSE_PVT_1_GLITCH_EN_ERR : RO; bitpos: [10]; default: 0;
 *  Represents the programming error of EFUSE_PVT_1_GLITCH_EN
 */
#define EFUSE_PVT_1_GLITCH_EN_ERR    (BIT(10))
#define EFUSE_PVT_1_GLITCH_EN_ERR_M  (EFUSE_PVT_1_GLITCH_EN_ERR_V << EFUSE_PVT_1_GLITCH_EN_ERR_S)
#define EFUSE_PVT_1_GLITCH_EN_ERR_V  0x00000001U
#define EFUSE_PVT_1_GLITCH_EN_ERR_S  10
/** EFUSE_PVT_1_GLITCH_MODE_ERR : RO; bitpos: [12:11]; default: 0;
 *  Represents the programming error of EFUSE_PVT_1_GLITCH_MODE
 */
#define EFUSE_PVT_1_GLITCH_MODE_ERR    0x00000003U
#define EFUSE_PVT_1_GLITCH_MODE_ERR_M  (EFUSE_PVT_1_GLITCH_MODE_ERR_V << EFUSE_PVT_1_GLITCH_MODE_ERR_S)
#define EFUSE_PVT_1_GLITCH_MODE_ERR_V  0x00000003U
#define EFUSE_PVT_1_GLITCH_MODE_ERR_S  11
/** EFUSE_PMU_FLASH_POWER_SEL_ERR : RO; bitpos: [13]; default: 0;
 *  Represents the programming error of EFUSE_PMU_FLASH_POWER_SEL
 */
#define EFUSE_PMU_FLASH_POWER_SEL_ERR    (BIT(13))
#define EFUSE_PMU_FLASH_POWER_SEL_ERR_M  (EFUSE_PMU_FLASH_POWER_SEL_ERR_V << EFUSE_PMU_FLASH_POWER_SEL_ERR_S)
#define EFUSE_PMU_FLASH_POWER_SEL_ERR_V  0x00000001U
#define EFUSE_PMU_FLASH_POWER_SEL_ERR_S  13
/** EFUSE_PMU_FLASH_POWER_SEL_EN_ERR : RO; bitpos: [14]; default: 0;
 *  Represents the programming error of EFUSE_PMU_FLASH_POWER_SEL_EN
 */
#define EFUSE_PMU_FLASH_POWER_SEL_EN_ERR    (BIT(14))
#define EFUSE_PMU_FLASH_POWER_SEL_EN_ERR_M  (EFUSE_PMU_FLASH_POWER_SEL_EN_ERR_V << EFUSE_PMU_FLASH_POWER_SEL_EN_ERR_S)
#define EFUSE_PMU_FLASH_POWER_SEL_EN_ERR_V  0x00000001U
#define EFUSE_PMU_FLASH_POWER_SEL_EN_ERR_S  14
/** EFUSE_POWER_GLITCH_EN_ERR : RO; bitpos: [18:15]; default: 0;
 *  Represents the programming error of EFUSE_POWER_GLITCH_EN
 */
#define EFUSE_POWER_GLITCH_EN_ERR    0x0000000FU
#define EFUSE_POWER_GLITCH_EN_ERR_M  (EFUSE_POWER_GLITCH_EN_ERR_V << EFUSE_POWER_GLITCH_EN_ERR_S)
#define EFUSE_POWER_GLITCH_EN_ERR_V  0x0000000FU
#define EFUSE_POWER_GLITCH_EN_ERR_S  15
/** EFUSE_ENA_XTS_SHADOW_ERR : RO; bitpos: [19]; default: 0;
 *  Represents the programming error of EFUSE_ENA_XTS_SHADOW
 */
#define EFUSE_ENA_XTS_SHADOW_ERR    (BIT(19))
#define EFUSE_ENA_XTS_SHADOW_ERR_M  (EFUSE_ENA_XTS_SHADOW_ERR_V << EFUSE_ENA_XTS_SHADOW_ERR_S)
#define EFUSE_ENA_XTS_SHADOW_ERR_V  0x00000001U
#define EFUSE_ENA_XTS_SHADOW_ERR_S  19
/** EFUSE_ENA_SPI_BOOT_CRYPT_SCRAMBLER_ERR : RO; bitpos: [20]; default: 0;
 *  Represents the programming error of EFUSE_ENA_SPI_BOOT_CRYPT_SCRAMBLER
 */
#define EFUSE_ENA_SPI_BOOT_CRYPT_SCRAMBLER_ERR    (BIT(20))
#define EFUSE_ENA_SPI_BOOT_CRYPT_SCRAMBLER_ERR_M  (EFUSE_ENA_SPI_BOOT_CRYPT_SCRAMBLER_ERR_V << EFUSE_ENA_SPI_BOOT_CRYPT_SCRAMBLER_ERR_S)
#define EFUSE_ENA_SPI_BOOT_CRYPT_SCRAMBLER_ERR_V  0x00000001U
#define EFUSE_ENA_SPI_BOOT_CRYPT_SCRAMBLER_ERR_S  20
/** EFUSE_RE_ENABLE_JTAG_SOURCE_ERR : RO; bitpos: [21]; default: 0;
 *  Represents the programming error of EFUSE_RE_ENABLE_JTAG_SOURCE
 */
#define EFUSE_RE_ENABLE_JTAG_SOURCE_ERR    (BIT(21))
#define EFUSE_RE_ENABLE_JTAG_SOURCE_ERR_M  (EFUSE_RE_ENABLE_JTAG_SOURCE_ERR_V << EFUSE_RE_ENABLE_JTAG_SOURCE_ERR_S)
#define EFUSE_RE_ENABLE_JTAG_SOURCE_ERR_V  0x00000001U
#define EFUSE_RE_ENABLE_JTAG_SOURCE_ERR_S  21

/** EFUSE_RD_REPEAT_DATA_ERR7_REG register
 *  Represents rd_repeat_data_err
 */
#define EFUSE_RD_REPEAT_DATA_ERR7_REG (DR_REG_EFUSE_BASE + 0x184)
/** EFUSE_REPEAT7_RSVD_ERR : RO; bitpos: [15:0]; default: 0;
 *  Represents the programming error of EFUSE_REPEAT7_RSVD
 */
#define EFUSE_REPEAT7_RSVD_ERR    0x0000FFFFU
#define EFUSE_REPEAT7_RSVD_ERR_M  (EFUSE_REPEAT7_RSVD_ERR_V << EFUSE_REPEAT7_RSVD_ERR_S)
#define EFUSE_REPEAT7_RSVD_ERR_V  0x0000FFFFU
#define EFUSE_REPEAT7_RSVD_ERR_S  0

/** EFUSE_RD_RS_DATA_ERR0_REG register
 *  Represents rd_rs_data_err
 */
#define EFUSE_RD_RS_DATA_ERR0_REG (DR_REG_EFUSE_BASE + 0x188)
/** EFUSE_RD_MAC_SYS_ERR_NUM : RO; bitpos: [2:0]; default: 0;
 *  Represents the error number of registers.
 *  The value of this signal means the number of error bytes in rd_mac_sys
 */
#define EFUSE_RD_MAC_SYS_ERR_NUM    0x00000007U
#define EFUSE_RD_MAC_SYS_ERR_NUM_M  (EFUSE_RD_MAC_SYS_ERR_NUM_V << EFUSE_RD_MAC_SYS_ERR_NUM_S)
#define EFUSE_RD_MAC_SYS_ERR_NUM_V  0x00000007U
#define EFUSE_RD_MAC_SYS_ERR_NUM_S  0
/** EFUSE_RD_MAC_SYS_FAIL : RO; bitpos: [3]; default: 0;
 *  Represents error status of register.
 *  0: Means no failure and that the data of rd_mac_sys is reliable
 *  1: Means that programming rd_mac_sys failed and the number of error bytes is over 6.
 */
#define EFUSE_RD_MAC_SYS_FAIL    (BIT(3))
#define EFUSE_RD_MAC_SYS_FAIL_M  (EFUSE_RD_MAC_SYS_FAIL_V << EFUSE_RD_MAC_SYS_FAIL_S)
#define EFUSE_RD_MAC_SYS_FAIL_V  0x00000001U
#define EFUSE_RD_MAC_SYS_FAIL_S  3
/** EFUSE_RD_SYS_PART1_DATA_ERR_NUM : RO; bitpos: [6:4]; default: 0;
 *  Represents the error number of registers.
 *  The value of this signal means the number of error bytes in rd_sys_part1_data
 */
#define EFUSE_RD_SYS_PART1_DATA_ERR_NUM    0x00000007U
#define EFUSE_RD_SYS_PART1_DATA_ERR_NUM_M  (EFUSE_RD_SYS_PART1_DATA_ERR_NUM_V << EFUSE_RD_SYS_PART1_DATA_ERR_NUM_S)
#define EFUSE_RD_SYS_PART1_DATA_ERR_NUM_V  0x00000007U
#define EFUSE_RD_SYS_PART1_DATA_ERR_NUM_S  4
/** EFUSE_RD_SYS_PART1_DATA_FAIL : RO; bitpos: [7]; default: 0;
 *  Represents error status of register.
 *  0: Means no failure and that the data of rd_sys_part1_data is reliable
 *  1: Means that programming rd_sys_part1_data failed and the number of error bytes is
 *  over 6.
 */
#define EFUSE_RD_SYS_PART1_DATA_FAIL    (BIT(7))
#define EFUSE_RD_SYS_PART1_DATA_FAIL_M  (EFUSE_RD_SYS_PART1_DATA_FAIL_V << EFUSE_RD_SYS_PART1_DATA_FAIL_S)
#define EFUSE_RD_SYS_PART1_DATA_FAIL_V  0x00000001U
#define EFUSE_RD_SYS_PART1_DATA_FAIL_S  7
/** EFUSE_RD_USR_DATA_ERR_NUM : RO; bitpos: [10:8]; default: 0;
 *  Represents the error number of registers.
 *  The value of this signal means the number of error bytes in rd_usr_data
 */
#define EFUSE_RD_USR_DATA_ERR_NUM    0x00000007U
#define EFUSE_RD_USR_DATA_ERR_NUM_M  (EFUSE_RD_USR_DATA_ERR_NUM_V << EFUSE_RD_USR_DATA_ERR_NUM_S)
#define EFUSE_RD_USR_DATA_ERR_NUM_V  0x00000007U
#define EFUSE_RD_USR_DATA_ERR_NUM_S  8
/** EFUSE_RD_USR_DATA_FAIL : RO; bitpos: [11]; default: 0;
 *  Represents error status of register.
 *  0: Means no failure and that the data of rd_usr_data is reliable
 *  1: Means that programming rd_usr_data failed and the number of error bytes is over
 *  6.
 */
#define EFUSE_RD_USR_DATA_FAIL    (BIT(11))
#define EFUSE_RD_USR_DATA_FAIL_M  (EFUSE_RD_USR_DATA_FAIL_V << EFUSE_RD_USR_DATA_FAIL_S)
#define EFUSE_RD_USR_DATA_FAIL_V  0x00000001U
#define EFUSE_RD_USR_DATA_FAIL_S  11
/** EFUSE_RD_KEY0_DATA_ERR_NUM : RO; bitpos: [14:12]; default: 0;
 *  Represents the error number of registers.
 *  The value of this signal means the number of error bytes in rd_key0_data
 */
#define EFUSE_RD_KEY0_DATA_ERR_NUM    0x00000007U
#define EFUSE_RD_KEY0_DATA_ERR_NUM_M  (EFUSE_RD_KEY0_DATA_ERR_NUM_V << EFUSE_RD_KEY0_DATA_ERR_NUM_S)
#define EFUSE_RD_KEY0_DATA_ERR_NUM_V  0x00000007U
#define EFUSE_RD_KEY0_DATA_ERR_NUM_S  12
/** EFUSE_RD_KEY0_DATA_FAIL : RO; bitpos: [15]; default: 0;
 *  Represents error status of register.
 *  0: Means no failure and that the data of rd_key0_data is reliable
 *  1: Means that programming rd_key0_data failed and the number of error bytes is over
 *  6.
 */
#define EFUSE_RD_KEY0_DATA_FAIL    (BIT(15))
#define EFUSE_RD_KEY0_DATA_FAIL_M  (EFUSE_RD_KEY0_DATA_FAIL_V << EFUSE_RD_KEY0_DATA_FAIL_S)
#define EFUSE_RD_KEY0_DATA_FAIL_V  0x00000001U
#define EFUSE_RD_KEY0_DATA_FAIL_S  15
/** EFUSE_RD_KEY1_DATA_ERR_NUM : RO; bitpos: [18:16]; default: 0;
 *  Represents the error number of registers.
 *  The value of this signal means the number of error bytes in rd_key1_data
 */
#define EFUSE_RD_KEY1_DATA_ERR_NUM    0x00000007U
#define EFUSE_RD_KEY1_DATA_ERR_NUM_M  (EFUSE_RD_KEY1_DATA_ERR_NUM_V << EFUSE_RD_KEY1_DATA_ERR_NUM_S)
#define EFUSE_RD_KEY1_DATA_ERR_NUM_V  0x00000007U
#define EFUSE_RD_KEY1_DATA_ERR_NUM_S  16
/** EFUSE_RD_KEY1_DATA_FAIL : RO; bitpos: [19]; default: 0;
 *  Represents error status of register.
 *  0: Means no failure and that the data of rd_key1_data is reliable
 *  1: Means that programming rd_key1_data failed and the number of error bytes is over
 *  6.
 */
#define EFUSE_RD_KEY1_DATA_FAIL    (BIT(19))
#define EFUSE_RD_KEY1_DATA_FAIL_M  (EFUSE_RD_KEY1_DATA_FAIL_V << EFUSE_RD_KEY1_DATA_FAIL_S)
#define EFUSE_RD_KEY1_DATA_FAIL_V  0x00000001U
#define EFUSE_RD_KEY1_DATA_FAIL_S  19
/** EFUSE_RD_KEY2_DATA_ERR_NUM : RO; bitpos: [22:20]; default: 0;
 *  Represents the error number of registers.
 *  The value of this signal means the number of error bytes in rd_key2_data
 */
#define EFUSE_RD_KEY2_DATA_ERR_NUM    0x00000007U
#define EFUSE_RD_KEY2_DATA_ERR_NUM_M  (EFUSE_RD_KEY2_DATA_ERR_NUM_V << EFUSE_RD_KEY2_DATA_ERR_NUM_S)
#define EFUSE_RD_KEY2_DATA_ERR_NUM_V  0x00000007U
#define EFUSE_RD_KEY2_DATA_ERR_NUM_S  20
/** EFUSE_RD_KEY2_DATA_FAIL : RO; bitpos: [23]; default: 0;
 *  Represents error status of register.
 *  0: Means no failure and that the data of rd_key2_data is reliable
 *  1: Means that programming rd_key2_data failed and the number of error bytes is over
 *  6.
 */
#define EFUSE_RD_KEY2_DATA_FAIL    (BIT(23))
#define EFUSE_RD_KEY2_DATA_FAIL_M  (EFUSE_RD_KEY2_DATA_FAIL_V << EFUSE_RD_KEY2_DATA_FAIL_S)
#define EFUSE_RD_KEY2_DATA_FAIL_V  0x00000001U
#define EFUSE_RD_KEY2_DATA_FAIL_S  23
/** EFUSE_RD_KEY3_DATA_ERR_NUM : RO; bitpos: [26:24]; default: 0;
 *  Represents the error number of registers.
 *  The value of this signal means the number of error bytes in rd_key3_data
 */
#define EFUSE_RD_KEY3_DATA_ERR_NUM    0x00000007U
#define EFUSE_RD_KEY3_DATA_ERR_NUM_M  (EFUSE_RD_KEY3_DATA_ERR_NUM_V << EFUSE_RD_KEY3_DATA_ERR_NUM_S)
#define EFUSE_RD_KEY3_DATA_ERR_NUM_V  0x00000007U
#define EFUSE_RD_KEY3_DATA_ERR_NUM_S  24
/** EFUSE_RD_KEY3_DATA_FAIL : RO; bitpos: [27]; default: 0;
 *  Represents error status of register.
 *  0: Means no failure and that the data of rd_key3_data is reliable
 *  1: Means that programming rd_key3_data failed and the number of error bytes is over
 *  6.
 */
#define EFUSE_RD_KEY3_DATA_FAIL    (BIT(27))
#define EFUSE_RD_KEY3_DATA_FAIL_M  (EFUSE_RD_KEY3_DATA_FAIL_V << EFUSE_RD_KEY3_DATA_FAIL_S)
#define EFUSE_RD_KEY3_DATA_FAIL_V  0x00000001U
#define EFUSE_RD_KEY3_DATA_FAIL_S  27
/** EFUSE_RD_KEY4_DATA_ERR_NUM : RO; bitpos: [30:28]; default: 0;
 *  Represents the error number of registers.
 *  The value of this signal means the number of error bytes in rd_key4_data
 */
#define EFUSE_RD_KEY4_DATA_ERR_NUM    0x00000007U
#define EFUSE_RD_KEY4_DATA_ERR_NUM_M  (EFUSE_RD_KEY4_DATA_ERR_NUM_V << EFUSE_RD_KEY4_DATA_ERR_NUM_S)
#define EFUSE_RD_KEY4_DATA_ERR_NUM_V  0x00000007U
#define EFUSE_RD_KEY4_DATA_ERR_NUM_S  28
/** EFUSE_RD_KEY4_DATA_FAIL : RO; bitpos: [31]; default: 0;
 *  Represents error status of register.
 *  0: Means no failure and that the data of rd_key4_data is reliable
 *  1: Means that programming rd_key4_data failed and the number of error bytes is over
 *  6.
 */
#define EFUSE_RD_KEY4_DATA_FAIL    (BIT(31))
#define EFUSE_RD_KEY4_DATA_FAIL_M  (EFUSE_RD_KEY4_DATA_FAIL_V << EFUSE_RD_KEY4_DATA_FAIL_S)
#define EFUSE_RD_KEY4_DATA_FAIL_V  0x00000001U
#define EFUSE_RD_KEY4_DATA_FAIL_S  31

/** EFUSE_RD_RS_DATA_ERR1_REG register
 *  Represents rd_rs_data_err
 */
#define EFUSE_RD_RS_DATA_ERR1_REG (DR_REG_EFUSE_BASE + 0x18c)
/** EFUSE_RD_SYS_PART2_DATA_ERR_NUM : RO; bitpos: [2:0]; default: 0;
 *  Represents the error number of registers.
 *  The value of this signal means the number of error bytes in rd_sys_part2_data
 */
#define EFUSE_RD_SYS_PART2_DATA_ERR_NUM    0x00000007U
#define EFUSE_RD_SYS_PART2_DATA_ERR_NUM_M  (EFUSE_RD_SYS_PART2_DATA_ERR_NUM_V << EFUSE_RD_SYS_PART2_DATA_ERR_NUM_S)
#define EFUSE_RD_SYS_PART2_DATA_ERR_NUM_V  0x00000007U
#define EFUSE_RD_SYS_PART2_DATA_ERR_NUM_S  0
/** EFUSE_RD_SYS_PART2_DATA_FAIL : RO; bitpos: [3]; default: 0;
 *  Represents error status of register.
 *  0: Means no failure and that the data of rd_sys_part2_data is reliable
 *  1: Means that programming rd_sys_part2_data failed and the number of error bytes is
 *  over 6.
 */
#define EFUSE_RD_SYS_PART2_DATA_FAIL    (BIT(3))
#define EFUSE_RD_SYS_PART2_DATA_FAIL_M  (EFUSE_RD_SYS_PART2_DATA_FAIL_V << EFUSE_RD_SYS_PART2_DATA_FAIL_S)
#define EFUSE_RD_SYS_PART2_DATA_FAIL_V  0x00000001U
#define EFUSE_RD_SYS_PART2_DATA_FAIL_S  3

